["3-hour Feminist Captain Marvel AdsNot the Avengers Stan Lee created. Emasculates the heroes, and attempted to sell a new hero. The character Stan Lee created is completely destroyed. Even the abilities are messed up. This is not Avengers.", "Fell at the last hurdleI watch all films with an open mind and went into this 3 hour long film without any preconceptions.\n\nThis film really let itself down. The writers completely changed some of the characters, they tried to make it funny and failed at every attempt where it was cringe worthy and boring. The story was dragged out to its limit and went on for way to long.\n\nDon't waste your money at the cinema, maybe Google the outcome.", "3 hours - 20 mins of actionI was not impressed. Save your money and time. Wait till they show this in Netflix John Wick 3 should have been in this film and story line could have been way better!", "9.1?? 100% these are bot reviews. Too much talking, terrible Superhero movie.Too many cringe worthy moments. Too much talking not enough action. This is superhero movie, not looking for bloodly oscar performance. Time travel thing was silly nonsense. I felt like walking out.", "Bad movieI just sleeping in the movie theather, because, okay this is a \"Endgame\", but this movie doesn't have action and i didn't know why this movie don't a sink me.", "Made for the FansNothing really happening ....Captain Marvel is in it for a bit...Black Panther was in it too, not sure why\n\nDramatic scenes purely over the top....just seems like they tried to fit all 5000 Avengers into this film and actually forgot about the film\n\n3 hours, I'll never get back .......one good battle scene tho", "Cannot see what the fuss is aboutIt's long winded...easily could be half the 3 hours.... Superhero movies are about battles and heroes...not crying and moaning. Watching iron Man wimper off was such a let down. After watching every avenger movie, I am so disappointed. Only 1 good battle, and it's over too quickly. So so so disappointed...I'd take any other avenger movie over this one.", "plotholes quantumWhat a waste of fan service. Absolute cringe and quantum plot will blow your mind", "Zero storyThe movie is just very bad writing and is an epic failure for it lacks a coherent acceptable digestible fathomable sensible reasonable story or plot .. just sucks so bad that it hurts So much is wrong that I can't begin .. but for some reason people are lying .. even critics", "The actual Endgame for MCU begins from hereUnlike Infinity War, Endgame was there for only fan service, which is not something one should look for in a movie.", "Cheap sentimentalism and plot all over the placeThis was supposed to be the final movie that crowed the franchise and Infinity War set high expectations. I was utterly disappointed. The plot doesn't make sense and throws away a lot of character development, to the point that some of them are just shallow version of what they were in other movies (and could become).\n\nBut what really annoyed me was the sentimentalism that permeated the whole movie. It is like you have to shed a tear for every character and the movie is trying to make you cry in scenes that don't move the plot forward. If in Infinity War they really stroke a good balance between action and emotion, here they just are there for the sake of it.", "hiWhat's missing from \"Endgame\" is the free play of imagination, the liberation of speculation, the meandering paths and loose ends that start in logic and lead to wonder.", "Such a let down 😪I am a huge Marvel fan and have loved the previous Avengers films so went with high Hope's for this, unfortunately I was disappointed beyond belief. Long, slow, dull scences make up most of the movie with only about 10 minutes of actual action. Main characters are sidetracked for less popular ones and the whole film moves at a snail's pace. It really felt like they had run out of ideas and this is just a money making film. So, so let down and would not recommend.. recommend it to anyone", "Bit Of A ShamblesAll over the place & all in all very dissapointing - even some of marvel characters have morphed into embarrassing caricatures. Is it the writers fault or have some of the actors got a bit too much influence? ..... I don't get what planet anyone who gives thos film 5/10 is living on let alone all the 9/10 and 10/10 rating ... The mind boggles ....", "AMAZAINGThis movie was the best movie I have ever seen. Visuals, the actresses and actors, and plot. Everything linked up. I love this film and would recommend it to anyone.", "I did not like itIt is overrated movie - and not in the same level as infinity war. I think the two movies could have been merged into one 3 hrs movie and spare us the hype of 13 years old fans all over the world.\n\nIt is not worth it.\n\nMost of the parts are slow paced and dull, and the action sequences are not new or even surprising.\n\nFull of cinematic cliches.", "Incredibly dull finale of an amazing franchiseThe great thing about the Avengers-Franchise has always been this winning scheme:\n\n1. A range of very different characters like Thor, Spidey and Strange, clashing together in witty and funny dialogues that showcases just how different they are. Spidey cracking jokes about deep philosophic insights of Strange, while Thor asks about beer.\n\n2. Incredible fight scenes\n\n3. Both may be linked by a variety of different narrative elements, from film-noir/detective over comedy to splatter.\n\nIt's an easy base recipe, that may be filled with any narrative strings, so long as they are intriguing.\n\nProblem with the Avengers movies and the finale in particular is:\n\nThe winning scheme is NOT used and the narrative underlying is poor, at best.\n\nThey picked parts of a variety of comics (like the \"Thor get's irresponsible and fat\"-plot), which is ok and linked them very poorly together. It's a series of short plots, loosely tied together with no red line (other than \"Thanos is the Endboss\").\n\nSecondly, the acting is poor, apart from Iron Man of course! Even Chris Hemsworth and Scarlett Johanssen do a really bad job at depicting their character. The digitally animated raccoon is a highlight in terms of acting.\n\nThere is only ONE AVENGER-TYPICAL FIGHTSCENE, which is great, but does not make up for the rest.\n\nFoot-Note: As a Non-American, the Glory-Halleluja-Murica focus on Cap is too much. If you're patriotic enough, you'll love it, of course.", "Jesus Christ!!There's There will be blood and more recently Leave No Trace. And then there's this crap. Acting that makes my eyes hurt and a story so bad I just want to stop watching (which I did). It's movies like this that makes me lose faith in the art of film making. And the rating 8.7 just makes me wanna stop talking to people. What a waste of money...", "Avengers end gameI don't know how the movie get 8.4....i was getting crazy couldn't wait till the movie is over, that much it's was boring and I didn't understand at all 3 hour what is it all about, from first til lthe end.", "Very Long.Too long for bad plot. The movie is 3 t 1 min use your time better!", "Boring abd pales in comparison to Infinity warI was bored throughout this movie. 1. Nothing really happens for most of the movie and there are so many unnecessary long scenes. 2.There is one really good fight/ action sequence. 3. THEY DID THOR SO WRONG. I watched Infinity war the night before and I couldn't take my eyes off the screen. With endgame I was looking at my phone the whole time hoping something would happen.", "BoringSeemed like 20 minutes of action at the most out of 3 hours. The film didnt need to be that long. The scenes that were meant to be emotional were executed poorly, didnt make me feel anything other than boredom. Seems all the 10 star ratings are just from marvel fans! Face it guys, it is a bad film. The previous avengers was 1000x better. The whole length of infinity war was about them defeating thanos, in this film it took them 20 minutes.", "nopeI fell asleep during this movie and haven't watched all the way to the end yet because it's so boring", "Save ur moneyCompletely wasting for time and money, I expect this movie will be the best Marvel's movie but it was the worst.", "Snooze....My kids were very excited to see this but I was more apprehensive. Really, the film is far too long, just unnecessarily. Parts of this film were very boring and were an ideal time for a cinema snooze! It had so much more potential but directors lost site of their aim. Disappointed.", "Like blending all your favourite foods together and expecting it to taste greatThe plot was messy, and so vast, with so many amazing characters, who were all simply diluted into one giant mess of a movie. Didn't really find the humour amazing either.", "Top Rated Movies #9, are you kidding?You really think this movie is one of the greatest movies all-time? Better than Forrest Gump, Inception, and The Matrix? You must be joking!!", "UninterestingI did fins thia movie highly unrealistic. There is no chance this could happen i the real life!", "Hulk SadThis film was so poor I left feeling the whole MCU was less because of its existence. I now think twice before putting on any MCU film knowing that this is the Endgame.", "Not as good as everyone saysSo i just watched it for the second time yesterday and i have to be honest this movie is boring as hell until the final fight and now that I watched it for the second time the final fight was ok this movie is so overated in my eyes firat time i watched it i was nearly falling asleep in theater because nothing intersting was happenning people going to hate me for this but I dont care I had more fun watching Dark Phonenix then this boring ass movie mcu movies are so overated in my opinion!", "Better than Game of Thrones Season 8What a boring, predictable excuse for a movie. I'm so glad I resisted the hype and didn't suffer through this in the theaters. It's obvious this movies reviews are artificially inflated on this site, just look at all the other negative reviews.", "Mi QuestionNow, that a week has spend after his releasing ay theatres, i'll explain muy question in Pesce. After five or six years after this, could there be something about this movie that makes recomended, else of his hype and the marketing?\n\nI Am not a really Marvel or DC's fan, but i loved some of their movies such as; DC's: Dark Knight all, Wonder Woman, Man on Steel, Shazam. And Marvel's: Guardians of the Galaxy, Dr Strange, Winters soldier, and of Course: Infinity War. But i was waiting a lot about this, i has too big expectations, them go to the midnight releasing and i found a fast food product of movie; horrible script, horrible performance, stupid logic, terrible story. Really is this the current cinema's way? I ll'get out of this awful and cheap movie theather.", "paydayThe final scene is like a payday and the list of actors showing up for Marvel universe is starting to look like a bread line. Enough. Please.", "If youre not a specific avengers fan, this movie is boringI haven't nt seen all the Marvel movies, but I've seen some - the Iron mans, the Ant mans, Cpt Marvel. I enjoyed them. I thought I'd go and see what the fuss was about. However this, is so formulaic, ridicilous and boring I couldn't take it for the whole film. I walked out after 2 hours, and it felt every bit as long as that. If you're not a huge Marvel fan already, you may well not like this film, because I feel it's somewhat self-indulgent. It's like an effort to squeeze a bit more money out of fans.", "This is all we get as the capstone of Marvel's phase whatever?Terribly disappointed in the effort. There should have been something \"more\". The movie plods from scene to scene with no real tension, almost as if marvel is giving the viewer the cliff notes on the last 10 years of films. Even the end battle was snooze-worthy, including the mostly useless Captain Marvel showing up as the deus ex machina.", "Thanos please Snap this Movie!Thanos please Snap this Movie is bad Script writing!", "A complete hypeI have watched the movie when it was just released. A couple of months later and I was looking at the reviews. I cannot believe all the 10/10 scores for this movie.\n\nPersonally I was extremely disappointed with this final movie. Infinity war was an amazing good movie, end game delivers a very simple story based on the time machine concept with plenty of flaws. While I understand the hype and the popularity of the MCU the movie was not bringing me what I was hoping for. There is no further clarification of what led to this movie. The new hulk is another example what I believe was too far fetched. But I don't think I should continue. Surely it is a must see, but for me remains Endgame one of the less convincing movie of this long series of movies brought to us in the las ten years.", "An experience you will never forget! (Not in a good way!)The avengers: End game movie is the worst out of all the marvel movies. With an horrible end and a bad plot. For a normal, sane person this is a too wacky movie with a lot of weird twists. The only really good thing in this movie is the avengers theme song that gives the movie a little spark in the total darkness that it is in. If you consider watching this movie DON'T.", "The end of... NOTHING, it's Overrated and boringThe worst superhero movie ever and with GoT is one of the most Overrated Things ever. Awful and ugly movie", "marvel surely you could do betterWhile the visual effects were incredible and the memes coming out of this movie were entertaining, I don't think marvel really put too much work into this ending. I went into this movie interested in watching mcu movies and came out completely against them. Probably will never see an mcu movie again.", "What an movie- i'm nearly speechless.This movie is pure awesomeness. This is a movie, i will be remembered for eternity. Just a big thanks. Cinema was never so much entertaining. Can't wait for blu ray disk", "If you haven't, don't! Then it can't be ruinedA box office success, sure, not based on its merits though but rather that of its predecessors. Visually spectacular as we've come to expect from the Avengers franchise (and the only reason for the stars) otherwise unnecessarily long, bordering on boring and full of plot holes. A few endearing scenes and one major scene were the only semi-redeeming factors. Otherwise just SO SO disappointing **SOB**", "If this was a drill, it would bore to earth's coreFirst 30 minutes everyone is moping around couldn't hang around for another 2 & a half hours to see overpaid morons do senseless acts. I am ashamed to contribute towards this movie's box office record.\n\nPS: I am not a dumb merican who likes stupid action without a story. Disney has ruined movies no one will make quality movies anymore just idiotic superhero stuff.", "Too looooongCould have been an hour and a half and twice the movie.", "Movie was weakWatch it honestly. My 5th grade sexual harassment class had more relevance then this. And I made the mistake of buying it.", "Way OverhypedIt's hard to believe that this is the highest grossing movie of all time. It's not even that good of a Marvel movie.\n\nI understand that this is based on a comic book characters but damn! The fact that this movie is so successful is pretty much the reason why Hollywood thinks they can get away making movies that aren't all that well thought out but look cool. The first hour was downright painful to get through and if they had taken out a lot of the unnecessary crap, this movie easily could have been 2 hours long.", "It was terribleI can't describe my disappointment. The movie was very boring with predictable happy end.", "DisappointedIt was an disappointment! That's all i can say ! Absolute trash", "Pure garbageIf you like spending three hours listening to explosions and ridiculous plot then this is the movie for you.", "What a shameIf I could erase this film from my memory that would be great. I am going to go with avengers ending after infinity war. I'm not sure why people are worried about spoilers as the same thing happens in every movie. If you haven't seen the film yet think of the stupidest thing you could imagine then try and complicate it by banging on for 3 hours and it will be pretty close to this absolute trash of a film.", "boring, bored, boredom - what a mess of a movieWhat a crying shame that a movie that had so many people awaiting its arrival delivered so little. And, it seemed to take forever to deliver that!\n\nI believe that this is one of the most critical reviews I have ever given and believe me, I firmly believe that it is wholly because my expectations were set so high by the franchise that it was pretty much doomed unless it was mind blowingly good.\n\nIf the story had had one thread of; 'that was believable' or even an odd; 'that could work' it may have been able to recover but, it doesn't. It doesn't even have a; 'that was cool' at any point either!\n\nIt's actually so boring I had finally found a movie I could replenish concessions during and didn't feel like I had missed anything. The reality is that I probably missed some really critical parts but it didn't matter, the movie had lost me long since then.\n\nThe entire story was so convoluted that it was just plain terrible. The basic thread was non existent and I agree with many other reviewers that certain characters were pointless.\n\nSynopsis: Infinity wars was mediocre, this isn't. Also, personally, it has done so much harm to the franchise, I for one won't be bothering to spend the 'sizeable' costs involved in cinema excursions for any Avenger related future offering again.", "I don't get it.This movie was awful; the acting was abhorrent, the special effects looked like a spy kids movie, and the plot was verging on completely ludicrous. I was ready for a simple popcorn flick, but this movie committed the worst crime of all; it was horrendously boring.\n\nThis film had zero depth, the characters were two dimensional, and the jokes mostly fell flat for me. The actors looked bored, and at times there was more green screen than the Star Wars prequels. Worse still, there were times where it felt like certain actors weren't even on set at the same time as the others, and it was all edited together afterwards.\n\nI wish I had the infinity glove so I could click my fingers and cut this movie by 50% of its runtime.", "Alita: Battle Angel was better than this \"End Game\"!Overrated and slow as hell. I was yawning whole time during first-half, second half was little better. Don't know the taste of people nowadays creating so much hype for an average movie. I found Alita way better in all aspect action, story, vfx still it is underrated. Eagerly waiting for Alita's sequal soon.", "BombGlad I only wasted $4 watching this awful movie. 3 hrs I never get back . I really liked Guardian of the galaxy and infinity war . But this is just trash .", "You thought Cpt Marvel was bad?Watch this movie, it can be far worse! I understand that Infinity War set a high bar but this one is a joke; time travel, better known as \"deus ex machina\" for lazy writing, is primary thing here that was never explained.\n\nAnd trust me, that is the least of the problems!\n\nYes, the effects were nice so hence 2/10 but effects were never so important in Avengers; others at least had some sort of story and action, this one is dull.", "Oh come on", "What?Not a good movie, if your a fan of the comics go see John Wick instead, poorly written cash grab,", "Not as epicIt was underwhelming. I guess I had expectations for it, some people hyped it up too much. Infinity was better.", "The movie is OK.There are numerous plot holes, and honestly, it has been overhyped. Is it worth the watch? Yes, once. But the childish humor and ridiculous plot do not make this a 10/10 or anywhere close.", "How the mighty have fallenAfter Infinity war I thought we would get a epic conclusion. That is no where near the case. I have no clue what the people rating it 10 watched, there must be two versions. This one movie pretty much ended my love of marvel films. And will be my likely be my last. Terrible writing ruined and killed off beloved charters. I like how Captain America was handled. But wrong person got shield. The movie was 2 and a half hours of garbage. With 30 minutes of ok action. Had a couple good moments but that's about it. What a huge let down from everyone involved. Save your money wait for it on Redbox.", "Worst Marvel MovieThis is the best worst marvel movie i ever seen so much lag", "A large mess.This movie was a complete mess, after all the years of build up, I didn't care. It was like putting an entire smörgåsbord into a very small bowl. All the flavours and textures blended and lost their appeal. Only two characters stood out, Thor and Antman.", "What a disappointmentI must have watched Infinity War a dozen times, so as you can expect I was expecting big things from this movie. How wrong was I. Shockingly disappointing. The people on here giving 9 and 10's must be scoring infinity war by mistake. The film was so boring and the story was rubbish. CGI took a massive step back for me. I will not be watching this dribble again. Well unless it's on cable tv at Xmas day in 4 years time and I'm too full of dinner to get up and change the channel.", "DisappointingToo many plot holes. The first 90 minutes were really slow. The next 90 minutes were too rushed. Infinity war was wayyyyy better.", "Terrible Follow-up. Want My 3 Hours Back.This movie drug on far too long. Captain Marvel ruined every scene she was in. Stars given for Thors performance which was hilarious. Looking forward to Ragnorak 2, maybe.", "Blockbusters and the unpredictable virtue of ignorance.I can't believe this movie got a so hight raring. Even hours of this trash can't compete with 15 minutes of other masterpieces that sadly no one talks about. The average audience, who wouldn't even distinguish wes Anderson from Tarantino, cares to write unwarranted reviews, and the fact that the most famous platform in the world (and the last word on the success of a movie or not) allows it, in my opinion, It's an affront to the art of cinema.", "Underwhelming at bestHad a lot going on. Expected a lot more emotions to be evoked. Left me asking for more in a negative way. Moved too fast. Other than the fight scene, which envoked the feel cause of its grandeur, nothing actually makes a lasting impact on you", "Predictable and lameMediocre in the extreme for easily pleased geeks who have zero appreciation of real cinema Too many characters, poor script and cringe worthy dialogue all add up to making a predictable mess of a movie.", "Walked of out it.Frank Capra had a golden rule - a movie can be many things but the number one sin is boring. Endgame - wanted to like it, spent money to like it, and .... boring. long, talkative and not worth the time. 2 hours would be fine, stretched to 3. Comedy was good mostly but not the padding. Long long intro shots of this and that. It finally hit the gold standard of DC. It took itself way way too seriously. So I am disappointed and sad. About right up there with Star Trek - The Motion Picture for boring. I don't like writing this, but ....... boring.", "So disappointedI've expected much more as it was the final chapter but to be honest infinity war was much more interesting and mind banding, the story happened in the end game I expected them almost all of them before watching the movie so I was waiting to be proved wrong and get excited unfortunately I wasn't, End game was more emotional rather than interesting, they paid too much attention to viewers satisfaction they did what emotional viewers would have wanted.\n\nEnd of the story", "Just boringThis film is 181min long and only 5min are good. The rest is just boring...", "Beginning of the endAvengers: End Game is long, boring, and predictable--with an endless amount of fan service. The humor in this movie just doesn't get a laugh. I cannot express how disappointed I am with the conclusion of 10 years of movies. I'm shocked this film is actually getting good reviews. This will be the last Marvel movie I see on opening night. I cannot help but think this is the beginning of the end for the MCU. It was good while it lasted.", "BoringThe strongest hero is kept out of the story and did not even explore her powers here.. \"Iron man Endgame\"", "DreadfulThe first part of this film is painful to watch, as there's very little dialogue. The plot isn't much good either. I don't see why people loved it so much. And it's way too long.", "Overhyped and underwhelmed.It's long, and I don't mean in time length, but plot. It FEELS loooooong. The LOTR trilogy flew by. This...did not. And I'd love to know why Cpt. Marvel was in there at all. The climax is amazing. It is truly the climax of climaxes, but that's not surprising. Any superhero movie with its salt, is going to have a badass battle against good and evil.", "like a comic book thicker than war and peace - only a lot more boringCoulda been done 1m better in an hour or so - too much crap on the hot dog to get a decent bite", "RubbishI tried to rewatch this pathetic movie 3 times. 1st time from the very beginning, 2nd time from 30th minutes, 3d time from 60th minute. With the same result: the film was just boring. Waste of time.", "Worst of the 4 Avenger films!Left the cinema disappointed!\n\nNot a patch on infinity war - in fact I would of preferred finishing the franchise with infinity wars ending! Ragnorak had natural humour - they tried forcing humour into this and it went down like a lead balloon!\n\nPredictable drivel focussing on boring characters - how are people giving this over a 5? Made a mockery of the 21 films before it - hulk and Thor's character????? Ridiculous!\n\nAvengers infinity war 9/10 End game 2/10\n\nZzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz", "Blah, blah, blah...I would have been happy if \"Infinity War\" had been the last installment. Let viewers decide if Thanos was right or wrong. Give us some credit. It may be a comic book franchise, but it was a semi-smart one. Was. Too long, too light on plot, and not engaging at all. 3 hours of my life I'm not getting back...", "AwfulGave it an extra star because the ending was a fitting finale. If you haven't seen this at a movie theatre, then just wait for it to come to Netflix or whatever streaming service Disney will release. I was in the theatre for close to 4 hours and it's just not worth it.", "Love Marvel, hate EndgameLove adventure, superheroes and Marvel, but this movie was awful and completely booring. This should have been made into a 15 minute ending of the previous movie. Don't understand who this appeals to. We were a mixed gender group and all of us just waited for it to finally end. Don't except anything exciting or interesting. The plot is easy to see through and they fail miserably to create any emotional connection with the audience.", "Made with a deft handHow can we take insignificant uninteresting stuff and make it awesome stuff because this flick has loads of characters and you may or may not like the premise of the jeweled glove and having to stop Thanos' destruction. Do you like that premise? To make awesome from awesome is something but un awesome into awesome something else to do. First the bad is it has too much melodrama with faces filling the screen in different emotive expressions to bring more \"important\" to everything. It's like the Looney Tunes episode of opera singing with Bugs, Elmer Fudd, wearing helmets with little wings, and a fat white horse, the type that of helmet that Thor wears too. Never into this episode because I like FUN. Or like the symbol of acting, the frowning face and the smiling face so I get there's an audience for this that I'm not for. The other thing is referencing other movies in here. Some of the references people might not even like, numerous time traveling flicks mentioned, Hot Tub Time Machine, Terminator, BTTFuture, Time Cop, Bill and Ted, even in Cap: Civil War I recall Empire Strikes Back which I thought the same thing but didn't think there would be way more in this movie by the makers, as some may not even like some of those movies. This isn't a tv show, but a movie, it sounds like something people you're around would say, not actual characters in the movie. Thirdly there's too much sentimental domestic stuff rearing itself with too much \"family\" shyt , little kid crap, YAWN. This was a problem in Captain Marvel in the mid part in some shack remeeting an over emoting lady friend and her tyke, I was expecting Cap Marvel to present some tampons to her to ease her, or even the Skrulls wearing sweaters to make it cuter. These are space warriors in the comics, for Pete sakes. This is off the top of my head. In Endgame what I'm talking about is perfectly shown in one scene out of nowhere this happens: this guy is sitting on a front porch (I get he's from Iron Man but others may not have seen that) and his tyke says she wants cheeseburgers. \"You can have all the cheeseburgers you want, cheeseburgers, all of them,\" paraphrased, while spacing out having a sedated appearance, and this just cuts to another different scene. What the?!?!?? Geezers sitting on front porches, thanks movie. This encapsulates why this domesticated crap is crap.\n\nNow the good stuff is this is funny af (af acronym was actually on some billboard recently kid you not) moments from Thor, a delightful chap, who's taken the spotlight a lot recently after being in the shadow in the early MCU, the opening scenes from Guardians is reshown from a diff perspective of like Starlord doing the same walkman listening and miming motions while the current superheroes spying on him hilariously. The revisiting of other Marvel movie scenes kind of work like from Thor: Dark World, Avengers 1, Cap: Winter Soldier. Dark World domestic scene works because it's around palace intrigue and I like the vibrance of that movie being the first MCU movie I saw. And also the elevator scene from Winter Soldier is reduxed in a funny way, and the Battle of NY from Avengers 1 also. The other thing is a fight sequence between Thor, Cap, Iron Man against Thanos which is impressive wow. It's here that it also shines. I think these other MCU scenes with a different spin are kinda cool, although I would have liked just to introduce its own thing this movie. I mean you don't see in Avengers 1 them resisting scenes from their solo movies. I know that they want to get this Thanos storyline out of the way though naturally and the whole story is just like the comics pretty much verbatim. Personally I'm ambivalent about that storyline frankly. I actually appreciate the movies that takes an insignificant plot and make something out of it.\n\nBut you know the good thing is these movies present loads of interviews, panel conferences, and those global cast events that are so entertaining to watch so ti's a win win. Wondering what is the key to happiness for all of those in those interviews. In Fractured Fairytales they say \"the happiest people are busy people\" but that's not quite, it's those who value their masculine and feminine (guys former and women latter obv.) It seems the doorways just open for those type of people, and the busy people-an illusion. I've worked so much and study and the doorways , are they flying open. It's these in these interviews, Scarlett who knows how to be feminine, Brie has a slight masculine to her and you see why people are like what the?? Cap Marvel movie people are not taken with that, it takes place like 2 decades ago and now men have to sit in theater who were around then and have to watch this smarmy lady onscreen, what does this tell you. Gwyneth Paltrow is another masculine, why is she here, the song in stores \"turn your magic on/I feel alive again\", you like that? She was with that guy until he's like no I don't want to deal with this masculine person I just want to make more songs forget this. I don't know the correlation between busy and this m/f thing I just know if you are too much in one it's OK to balance it out with the other thing to keep fun. I j/o every other day. Anyway so the movie has Thor hammer it up, Hulk smashes, Hawkeye lays some serious deep stick arrow, Black Widow looks spiderific, Iron Man unleashes blasts, and Cap just goes in raw.", "THIS IS WHAT DOCTOR STRANGE WAS ON ABOUT? WHERE WAS THE LIVING TRIBUNAL? 👀 OH BOY, THEY BLEW IT!!! 😔 THIS MOVIE IS NO LONGER PART OF THE MCU 23 MOVIES. IT IS 22.Where was The Living Tribunal? What A Disaster Movie.\n\nEndgame is the highest grossing film ever worldwide and the 5th highest worldwide when adjusted for inflation. But it was complete Garbage. It is not part of the 23 MOVIES anymore.\n\nAfter a year of waiting since that Epic Piece that was Infinity War, this is the Endgame that Dr. Strange was on about? What A Disaster, It was a complete shambles. They had perfect vision when they made Infinity War but it is like they lost the Power when making this silly borefest.\n\nProblems with this movie:\n\n° Where was The Living Tribunal? The Being was ment to Bring the Characters Back and Judge Thanos. Not this Time Travel Garbage.\n\n° What happened to Captain Marvel? A whole origin movie for her, for the build up to this and that's what they produce? Is this a Joke?\n\n° How can you destroy the Infinity Stones when each of them contain an Element of Existence itself?\n\n° How Can You Put the Soul Stone back?\n\n° How can Gamora come back from the dead but Black Widow Can't?\n\n° Why is Hulk a Big Joke? Isn't he the Strongest?\n\n° This Thanos doesn't know any of the people he is fighting.\n\n° The Time Travel fix everything nonsense, do they not get it? It is just too easy and boring.\n\n° The movie is way too long and boring.\n\n° Thor was a complete Joke\n\n° No Epic Battle between Hulk and Thanos that EVERYONE was waiting for.\n\n° No Proper battle between Captain Marvel and Thanos that was built up to happen.\n\n° The Final battle was Lacklustre\n\nThe Highlights were:\n\n° Great Quotes from Thanos\n\n° Captains America vs Thanos was Great\n\n° The 'I Am Inevitable' Snap from Thanos was Really Great\n\nThis Movie was terrible, what the hell were they thinking?\n\nThe Endgame should have started out by Thanos Seeking to Make another Infinity Gauntlet for the purpose of defence, then using the Reality and Time Stones to recover his army. Begin Fortifying his Defenses on a different Planet with his army defending him and getting ready for the Avengers final assault on him now that they have recruited Captain Marvel.\n\nThe Living Tribunal Should of Judged Thanos and Brought the Characters back in this Movie.\n\nOH Boy, they blew it. What a missed Opportunity. 😒", "At a complete loss for wordsNever in my life have I left a review on here however I felt obligated to after sitting through three hours of absolute nonsense. The film began an I was just at a loss for words, it felt like a practical joke. However I held out hope that it would get better, it didn't, it got worse. The way some of these beloved characters have been portrayed in this film literally made my toes curl up in embarrassment, it's absolutely shocking. Lazy writing, and beyond anti climactic. I've seen so many 10/10 reviews on here I'm half convinced the film I seen was actually a joke and all these other people got to see a completely different film than I did. I had so much hope for the Russo Brothers to make this a truly spectacular film and I didn't think it would be possible for them to mess up this bad. I had tickets to go and see it a second time later on today however I'd rather lose the money and not go than sit through it again. So dissappointed.", "A Terrible ConclusionThis movie lacked everything that made its predecessor Infinity War so great. The comedic take on Thor was the worst part of the whole 22 movie franchise. The pace of the movie was slow and boring. Overall, this movie is one big disappointment.", "Not worth all the fussI didn't like being disappointed by it but it didn't do all the years of build up and the characters justice. It has good comedy but ultimately felt like a lacklustre way to end things. Less of an Endgame more of just an ending.", "Not as i expectedI had such big expectations for this movie and i was so anxious to see it that in the past two weeks i kept dreaming and thinking about it every day. But, unfortunetly, the movie dissapointed me pretty much. I really like the Ruso brothers and they have had great imagination and are good at what they do, but this movie was casted and filmed in a hurry with little to almost no action at all and lack of inspiration and imagination. They could have done a much better job with the Endgame movie but i guess that is what happens when you rush to make even more money and don't care much about the fans. Hope they make it up to us with their next movie.", "Worst avengers movieToo many plot holes and scenarios that don't line up with what was put in place in the previous MCU movies. Massive let down for the entire story arc. Best to have the MCU movies end with Infinity Wars.", "It's just Fan serviceThe movie was made for only two things, the first eliminate all the old actors with a supposedly amazing end, that is just Fan service. And the other fact is that Marvel just wanted to make money however they could do something more impression.\n\nI have to admit that the special effects were fantastic and the movie was really funny to watch.", "Why thoI'm confused... How can one fail so miserably when you have basically an infinite budget to create a film?!\n\nWhat a let down! Who even gives a about Hawkeye?!", "Infinity war is 3000 times betterOne of the top boring superhero films! 3hrs of runtime makes no sense w/ all drama & the action part being not more than 30min.... Not worthy to watch again!", "Too LongWhat a waste of 3 hours. Too long, boring and ridiculous.", "3 hours wasted3 hours of boredom, pain, suffering and cheap fan service. One of the most overrated movies.", "Such a disappointment3 hours of crap. One guy says time is not linear and damn! Quantum physics solved.", "How is this film over 8 rating?!It made me fall asleep twice after seeing it twice. It was all over the place. It's Marvel trying to make every film a comical genius and ends up with mixed salad gone rotten\n\nThe writing at the core needs a rework. Nothing flows well. It's like a mixed bag of junk into 3 wasted hours!!\n\nSome comedy is fine but it's relentless I give up on this type of film making for quick cash grab and bad story telling.\n\nI would not bother seeing another Marvel show after seeing what has become a great franchise. It's obliterated into oblivion.\n\nWhy do I need 600 words is beyond me on a film that's not worth seeing.", "I am disappointed. This is not Marvel any more.The first part of the movie is a sitcom, talking and dad's jokes. It almost(!) catches up with \"Friends\". If only movie was released in 1999... The second part is even worse, It reassembles \"Back to the future\" but it definitely does not catch up even to 1989. And there is this third part. Explosion of... left-wing ideology. You will instantly get a T-CD4 lymphocytes drop and vomit with rainbows. It ends with: SPOILER ALERT Capitan America being now black. The CGI is great, I enjoyed it very much. But the best part of the movie was a trailer before. There is still hope in this modern world. \"Bad Boys\" are still black and still as brilliant as in 2009. I'm looking forward to watching them again.", "I Wish this Was the EndSoulless junk. The first act promised a serious take on the nature of revenge but the movie quickly gave up on interesting thematic and became a senseless mess.\n\nI didn't care for a single character, the action was a confusing mess and the new characters do not give me much hope in the future of these Marvel films. On the plus side, this may mean diminishing returns on future instalments in this \"cinematic universe\" which would be great news for original films that aren't getting screened theatrically from the many megaplex screens being eaten up by this cynical capitalist trash. But hey... maybe the kids like it?", "Awful movieJust watched the movie. Despite my best wishes, I simply cannot find myself singing praises to such a poorly-done movie. Ranging from the grossly obvious CGI to the poorly written-out story line, Endgame is extremely underwhelming. Throughout the movie I found myself sitting in utter disbelief as to how Endgame went so wrong after a fantastic Infinity War.", "Truly this is better than Taxi DriverBurn you Scorsese Blurays for another marvellian mass production... ummm... product is here! Let's get some CGI going, so happy we do not understand even the basics of the human psyche. Let's make sure no-one does! Let us judge everyone for we are truly better. Let's keep that PC flag flying high. Let's not see anything that it real, let's polish the world. We all hate real movies. Alpa Chino truly stands for Booty Sweat. Thank you so much!", "Overlong and overhyped superhero movieThis film is more than 3 hours long. The length is totally unjustified and merely makes the bland dialogue and CGI dependent fight scenes even more tortuous than they would have been had this been half the length. No element of real danger, little intelligent wit. Avengers: Endgame is the epitome of the malaise in the movies that studios and the public choose to make and watch. You will not get these three hours back again.", "boredI only saw a bored and weak plot, nothing new, all time with this kind of movies is marketing, I am getting bored with super heroes movies, even more action parts are so simples", "I was more disappointed than I thought.First of all, some reviewers think that whoever doesn't like the move is an idiot, obviously those people are the idiots because these are only opinions, now about the movie, I didn't watch it expecting much to be honest, there is a lot of action, more than you have seen in the other previous movies, but my problem is with the plot and how the bad guy could have easily been defeated in more than one way during the movie but obviously no, which only shows to me how greedy the movie producer are, I think many people don't care if the story is bad as long as there is action, but for other people like me this is really an insult to our intelligence. I won't waste my time and money on the next one.", "What were they thinkingIn all my years as a Marvel Comic fan this is the worst outing as far as I am concerned. Yes it did follow through on many out lying factors but I was gob-smacked as to the ending. While I will not give away the ending I will say I was greatly displeased. It would make me think hard about spending my money on their next Marvel outing", "Too longAvengers Infinity War was way too long. Endless fight scenes, nonexistent plot, cheap deaths. The 8.9 rating proves that IMDb is irrelevant when it comes to rating the quality of movies. This was so disappointing.", "plot holes, inconsistencies, incompetence, illogicalities oh my!!!!!!!!!Nothing made sense in this marvel movie. When back in the day people used to make fun of superhero movies for their vapid storylines and characters, i actually found ironman to have a very good character development and even the 1st avengers to be entertaining and most MCU movies to have a logical flow. This movie made no sense and was just 3 hours worth of deus ex machina. This IS ther superhero movie people used to complain about. How did it possible get an almost 9 star rating?!?!?! wtf!?!?! i've nvr reviewed a movie before but i had to this time, it was the ultimate disappointment.", "Marvel Biggest super hero movieIt was boring and I Sleep when I watch the movie It was Kid Family friendly I don't get any jokes the best thing in this movie is Thanos Poor CGI", "KitschThe movie is a great example of kitsch. A definition from web: \"Kitsch is art that's garish, nostalgic, and very low-brow. Some people who love the aesthetics of souvenir culture think kitsch is really cool, while others think it's in very poor taste.\n\nKitsch is a German word that's been adopted into English, meaning \"worthless, trashy art,\" or the quality of that art. A ceramic figurine of a puppy with sad eyes is pretty kitsch, as is a velvet Elvis painting. Of course some people think that kitsch is really beautiful and fill their homes with stuff that other people consider trashy souvenirs. If your painting teacher tells you your portraits are kitsch, that's probably not a compliment.\"", "Most disappointed movie in 2018The visualization is really impressive. But the story sucks. Marvel is ruining the reputation by putting all the superheroes together without a whole story.", "PARTY!Imagine yourself being one of the characters. Can you see the logic? Can you feel the motivation of both protagonists and villains? How would you feel about the Avengers' choices and dialogs? No? No! Just no... No effort implemented in making of this rubbish. Defying physics and common sense, defying background story that was building up for 10 years. A bunch of ppl runnung around having fun, looked like a party movie.\n\nIt was like a potpourri: we've recently seen every scene in a bunch of another super hero movies. Even the final sequence is similar to X-men. All those \"professional critics\" who write these prepaid positive reviews for yet another Disney's garbage should be ashamed of themselves. Is there nothing saint left in the world? The most hyped and messy movie of our time.\n\nWas Thanos making a party machine all this time? Cause random (not. check hero rating) people are getting turned into confetti with expensive and safe explosions on the green screen - very underwhelming and lame.", "Too simplistic!I'm tired of the comic based movie genre which further signals the death of original scripts and content. Don't get me wrong, originality alone does not make a good story. This movie continues to try squeeze water from a rock and I leave wanting so much more. The movie was much too long and especially the fight scenes. As in the old Wendy's commercial, \"Where is the beef?\", or in my case a good story and characters I care about.", "Once again, no story, just bangs and booms.Unfortunately, computer-generated mayhem is much more important than character development.\n\nOne-liners is not good writing. There was such hope with the Dr. Strange movie and nice writing....but this \"Avengers\" film does nothing to add to any of the previous characters' story lines...especially Dr. Strange.\n\nIt's a jumble, with explosions/death/violence...with little use or reasoning behind it's constant grinding noise.\n\nAll the tears shed by actors, had no heart behind it.\n\nIt's sad when money drives a movie rather than writing.\n\nJust because something owns Lucas Industrial Light and Magic, doesn't mean it has to be on screen at all times. I thought SE was supposed to be light-seasoning...not complete coverage.\n\nThe offering lacks in so many ways.\n\nSad...had high hopes.", "Big hype for not to do about anythingI don't know why there are so many positive reviews for this movie. I guess these days you jam a bunch of big stars, overdo the top special effects and a flimsy story line and you get a blockbuster movie. SMH", "Boring with minimal plot; I left the theater half way throughUnless you're a huge fan of this genre of movie, or of the Avengers, I'd strongly recommend skipping this movie. A friend and I went to see it, and left the theater half way through because we were so bored. Although the special effects are good, there really isn't any plot to speak of. For comparison, Black Panther was a much better movie.", "Disappointing.Disappointing. Simply and enough said. Do not recommend.", "No classSo boring. Feel like watching stupid drama series. When I see this movie all I can do is boring and think when this gonna end.", "I had to leave the movieI left about half way through the movie. Lots of stabbing and banging sounds. If that is your thing you will like it otherwise a lot of mediocre animated action with little substance.", "According to fanboys: as good as The GodfatherThis movie was litterly the same as the avengers and civil war. Nothing new here except that the hype is getting stronger??? By rules of nature hype must die down over time but marvel fanboys want more bad movies? Disney's board of director's and their shareholders are laughing their ass off. They acquire the rights of a universe with some superheroes en then they release 5 superhero movies a year that are complete and utter trash but its fanbase will love it no matter wat. now a cgi war movie (were we all now how of how it will end, it doesn't becouse Disney will keep spitting out these movies until marvel fanboys stop going to these trash movies.) Is considerd better than movies like Silence of the Lambs, Se7en, forrest gump and Leon??? Well if this is the case than i will leave this site and never come back becouse i use this site to see if a movie is worth seeing. But if a crap movie like this is considerd to be as good as THE GODFATHER!!! then i can no longer trust this site and will de-recommend it to everyone that wants to use it for the same purpose as i did.", "We'll Never See Magus (Adam Warlock) with Infinity Gauntlet, Great Villain MomentSome of us have waited 10 years to see Magus/Adam Warlock against Avengers and take Gauntlet from Thanos, one of Marvel's best memorable classic villain stories.\n\nThanks to Russo Bros decision for taking Adam Warlock/Magus out Infinity War movie and giving the character to James Geunn's (Guardians of the Galaxy).\n\nJames announced he's going to make Adam a younger version of the character instead of comic book traditional adult,\n\nJames is going to make Adam another silly serious comedian superhero like Thor.\n\nJames should use NOVA Richard Rider if he wants a teenager. DISNEY HAS TOO MANY MAJOR CHANGES TO CHARACTERS AND CLASSIC COMIC BOOKS PLOTS. Warner Brothers, Sony, 20th Century Fox has there comic book movies adaptions closer to comic books than Disney. 1/10 stars.", "Waste of money!Studios making bad content in order to appeal to the masses and shareholders is like fracking - you get the best return right now but you wreck the earth. It's ruining the viewing habits of the American population and then ultimately the rest of the world.\n\n~Jodie Foster", "I want a refundThis was one of the most - maybe THE most - disappointing movies of my life. The worst part isn't even the movie itself, it's that it killed almost every other marvel movie I used to love. I can't even go back and watch the old, good MCU movies having seen the craphole where they all lead. I'm swearing off Marvel, swearing off Disney except for the kids' movies, and trying to figure out how to get the theater to not send the money from my ticket to the studio. I don't care if I actually get the money back, I just don't want it to go to the studio for making that train wreck.", "My first and only one-star reviewGarbage movie. The fact that this is rated #30 movie of all time is just unfathomable!", "Bad Ending too obvious, Too much hype , An overrated movie.Too much emphasis on realistic violence, whereas the ending was a total obvious bang to wait for the next movie. The story plot was lousy, Might as well turn off your brain while watching.", "Awful. Boring. Nothing was good in this movie.I wasn't expecting much going in. I figured it would be all action, since there are so many characters. But I at least thought some of the action would be entertaining. But it wasn't. Not one action scene was any good. Thor Ragnarok was a masterpiece compared to this. This movie was truly dreadful. My girlfriend, who normally likes any superhero movie that's action-packed, even though this movie stunk. Many boring scenes of talking....all about nonsense. Because when every single character can do absolutely anything....when every character has powers that are limitless....like for instance, let's go to outer-space, let's teleport, let's shoot a rope that curves 20 times and wraps around our opponent....when anyone can do anything....the result is total boredom after a short while. The 9.0/10 rating here is Fake News, I guarantee you that. Statistically impossible....especially for such a bad movie. I was sooo bored.", "I want my money back!Waste of time...may be the most expensive, dumbest and soulless film ever made", "No...Its like every other superhero movie...nothing special and waaaay to over hyped!! Come on guys..you really trink this is better than fight club, Forest gump, Matrix or lotr?! It is not!!", "DIsney ruined more beloved charactersDisney ruined more great characters by having too political writers involved and ruining important characterizations of developed and loved personas. WTG Disney for screwing up another movie.", "Infinity War Provides Infinite DisappointmentAfter ten years of epic waiting, we just got a chance to clarify that The Russo Brothers were an awful choice for Marvel Cinametic Universe. Infinity War, including over 30 main characters, starts with a quick plot without losing time to introduce our heroes. The movie goes on with funny bits popping out of nowhere during non-stop action sequences and sends us back home with a terrible ending. Suprisingly, it is not only bad because of lack of drama, but also the glorious fight between Avengers and Thanos brings out nothing original. The movie may serve as a great entertainment for early teens and comic-book fans, but surely not beyond that.", "10 years of insipidKeep in mind that just because s movie makes billions, that does not make it a good movie. Like most of Marvel movies this is an insipid mess. The entire plot took 10 years to develop and is summed up in this latest entry in 4 or 5 sentences. Acting isn't necessary or required, just grimace and look sweaty and vacant. Meanwhile we'll fill the screen with 50,000 CGI lights and explosions and convince you what is happening matters. Well it doesn't.", "Absolute pantsSPOILER: I have tried to write this review 3 times unfortunately every time there is a problem!!!!! So instead of an in depth review all I can say is this is just not funny and the story line incorporating so many characters (heroes) is confusing and just pants particularly when 50%of said heroes die... all good for a sequel but crap story guys. Seriously unfunny unlike Deadpool 2 which was awesome. To conclude unless you are going to do a lot better than this storyline don't bother with the sequel because no one will be interested..", "Frustrating and HopelessDear Users, In my experience of last fifty years - this is the worst movie. It has no consistent plot - no direction - no editing and most importantly no morale. You will be feeling thoroughly cheated while watching this movie.", "Who rate this 9?This was an awful movie! pretentious and trying too hard.. no plot, no story developement.. mediocre acting performances!!!\n\nOne of the leading actresses used to work for website videforex.tk as a model and account manager, how can she end up in a A-list movie?\n\nThe first avengers was quite original. But this one!!! I was excpecting it to be way better. I spent more time thinking about how cold the theater was than being interested in the things blowing up in the movie LOL.\n\nSeems Hollywood is now a CGI puppet for making superheros movies that shouldn't be made in the first place. If they keep making movies like this one people will start watching the 50' titles again.\n\nJust my cents.", "Film for kidsThis is a film made for children, not adults. Ninja-Turtles kind of movie. Stupid jokes, no plot, non-sense whatsoever. At least, when I was a child, films used to make if only a bit of sense; not any more for milennials, it seems. New world, new styles, very little brain. Pity...", "Not worth my money and timeThis movie made the good cast look stupid and no common sense. Made the bad or evil cast dominating from start to finish. I vote for nonsense movie of the millennium!!!!", "Ho Hum!!Typical CGI movie. No acting! The plot does not allow for acting. Too bad! A lot of good actors in this movie. Use them and quit focusing on CGI!!", "Just an awful waste of 2.5 hoursI don't typically write reviews; however, someone needed to balance out the over the top love for this bad plotted film with way too many stars. For me, it all comes down to this question: \"Can this movie stand alone without having seen at least 75% of the other Marvel movies?\" The answer is NO! I know I've seen most of Marvel's movies (loved Black Panther) but I think to enjoy this film you have to be a serious Marvel fan. Even with as many of the Marvel movies that I've seen, I still didn't have enough back story or character recognition to pull together this plot which seemed to me to just be an excuse to have CGI battles over and over. Then, to make matters worse, it's sooo looong. Add to that, that I need to see a sequel to see how this story ends and I hate it - 1 star out of 10 - done and done.", "Long and Boring: Worst movie of 2018 so farI'm not a fan of Marvel or DC or basically anything that Disney creates. Unfortunately, my friend wanted to see it and I figured: 1) There's a chance it could be good, considering there were other movies I thought were going to be bad, such as(Blockers, The Purge, Keanu, and even Wonder Woman) that turned out to be good, so I shouldn't pass this off right away just because it's Disney 2) I figured it couldn't be worse than Red Sparrow.\n\nAnyway, I was wrong to both of those. This movie is 2 and a half hours of weak plot, little script, visually unappealing CGI, bad acting, and continuous violence.\n\nThe only person in this movie who had acting skills was Robert Downy Junior. Benedict Cumberbatch was so insufferable that it's shocking that he's the same person who starred in The Imitation Game, which is one of the best movies I've seen this decade.\n\nThe entire last hour was nothing but fighting, killing, and brutal violence. I honestly don't understand how they can get away with rating movies with this much murder PG-13, when movies with significantly less violence and murder, like John Wick and The Hitman's Bodyguard, are rated R. Apparently our backwards society has deemed that killing and violence is an acceptable thing for children to be exposed to, but hearing the word Fvck will traumatize them for life.\n\nWith the exception of Robert Downey Junior, the way the people talked reminded me of 11th grade English class when we would read Shakespeare aloud in class. Also, as someone who was forced to go to Catholic Church as a kid, if you've ever gone to the Good Friday or Palm Sunday mass where they all read that dialogue in monotonous voices that's so insufferable you're in pain? That's how I felt in this movie. I would've rather been a child at Good Friday mass again, because at least then there was prospect of a Cream Egg for sitting through that drawl.", "all these super hero films...All the hype made me go to a theater to watch this. Well... what can I say, it is just like 200 other super hero films. Iron-man firing missiles, spider-man jumping around, etc. There is a villain, very strong villain... and what it is that he wants......? He wants to kill half of the population. Why? Because he thinks there is too much people! What!? A villain that is worried about the environment..... he must be from the green party, maybe he is vegan. Anyway... No story whatsoever, but 2 hours of action scenes and good effects (my wife was sleeping after 1 hour)... maybe good for teenagers.", "A movie is supposed to be ...I think a movie is suppose to give you ideas, make you think, pay a better attention on what's going on around you and show some of precious things in life that we miss on these days, not just a movie about comics with zero quality of being a movie ! Despite the war and all those useless speeches in the movie what else has the movie told you ? The mindset of people nowadays is going crazy and mad, this movie does not worth that rating and I don't know why I wasted my time on this useless movie .", "Save your time and your money; it's a real downerI wish I could have my 2.5 hours back. The film was over-long and packed with way too much violence for what it delivered as entertainment. It also spent too much time focusing on the villain and his rationalizations for genocide. I found myself wondering if such indulgences would seem inappropriate to dwell on for a real mass murderer like Rudolf Hoess, why is it appropriate dramatically for Thanos? Answer: It's not.\n\nThis film was easily the worst Marvel film I've seen.", "Harry Potter and the deathly hollowsThis is the worse film to date for marvel, too many plot holes, it was sold as an avengers movie should have just been infinity war, said every character was in it that was a lie, and was very much the same plot as the title that I have sub lined it.", "WOW! They got a lot of friends and relatives to rate this 'film' 10/10! It's not!Black Panther was boring as hell. Most Iron Man films were boring as hell. Doctor Strange was boring as hell. And don't forget Superman vs. Batman: BORING!! So what would you expect from this one?", "Sucks!overrated!I can't believe all the overhype this movie sucks Zero plot ....\n\n\n\nNot much to say,it just sucks", "Flaming hot garbageA bloated smorgasbord of uninteresting protagonists (save Iron Man) fighting an oaf with magic crystals. Not to mention, an overzealous color pallete and use of CGI that left me longing to stare into a dark, bottomless pit for hours. The obligatory Marvel laugh lines were embarrassingly stale, though inexplicably humorous to the audience. From the cheap moments of social awkwardness or the annoying insecurity of Quill vis a vis Thor, I found myself constantly groaning. I say all this recognizing Justice League was also hot garbage, but at least a few of the characters were interesting. Oh how I miss those halcyon days of Christopher Nolan's Dark Knight trilogy - where the drama prevailed and the characters were worth caring for. Batman v. Superman had it's flaws (Martha!) but at least it's got heart! I found myself checking my watch less than an hour into Infinity War. This crossover was indeed too ambitious.", "Most boring movie ever.Dragged on and on and on. Not one likeable character. A special effects movie with no plot. Fight after fight after fight with no one winning.", "Can Disney Studios Depart Into The Porn Industry Already?Because guess what, \"Avengers: Infinity War\" is a straight up porn for any fan of cinématography. The plot is as simple, formulaic and stupid as it can get. There is a huge amount of holes, henny. The chemistry between actors (hence acting) is non-existent. All that we get - is a portion of idiotic choices just to excuse the upcoming \"ACTION\". Ye, baby, gimme more... These sweet fireworks and a talking piece of purple CGI is all I need.\n\nThese \"Avengers\" might be mentally disabled: can't think OR use abilities OR communicate with each other. Well, at least they succeeded at jabbing one another with some jokes (a benevolent 1 star for this).", "It certainly is largeLotsa flashing lights and loud noises, little else. Went home and watched \"The Wolverine\" (the second one) to be reminded of what I like in a popcorn flick.", "bruh come onThis movie literally couldve ended in 40 mins why drag it to put more fight scenes and more jokes? 10 years for this movie plot???? did they hire zack snyder or what\n\ncool scenes but couldve been better thanos is weaker than he is in comics. black order is way worse!\n\nfor character strengths, whos ever stronger than another?! one character looks weak at a time OBVIOUSLY to pave way for \"heroic\" scene or entry of another and later the same character does a move proving to be the strongest in the battle zone. screw this logic.\n\nalso, if infinity stones are from before the universe, blah blah blah, how do they only affect a mile long lmao? so either thanos is weak or the stones (or both) in mcu", "What the hellI mean this was a decent movie, but come on. Ranking above \" It's a Wonderful Life \" and \"The Usual Suspects \" is bullshit. Marvel doesn't make cinematic classics, they make action filled blockbusters with no substance and 8 year old could understand. Take notes from Christopher Nolan's The Dark Knight, because that is a real tale of humanity, and human vulnerability in the face of action. Quit with this bull crap and give it a ranking it deserves.", "Disappointing!I enjoyed all of the Avengers movies, but this one was very disappointed.", "Bad storytellingTwo rules of storytelling: (1) heroes always win, and (2) if you have to explain it, you didn't tell it well enough. This movie is a FAIL on both points.", "TerribleWhy does everyone think this movie is so good. I feel asleep", "OverratedMaybe if it wasn't so overrated I'd actually enjoy its CGI. Anyway, it's very monotonous and long, nothing really stands out and a twist in the end is so predictable. It pretends to be serious, but why would even bother? Jokes are so dull they make you cringe.", "A little disappointed - expected more ...Before you pay the witches some loot to go for me, hear me out please;\n\nThe graphics and special effects - brilliant. The story line, well. I do think that they should maybe consider appoint better script writers in the future. It just maybe work on paper but it did not go that well on film. The other major point that just beat the heck out of me was the over focus of certain characters and then the total lack of others.\n\nThis was more a \"cleanup\" movie than anything else. The end also, just WAY too much and the result thereof - really. The plot was good to a certain point and then this over focus of elements / characters.\n\nMy sisters (twins) LOVE this movie. Probably watched it in cinema already 4 times together. We do have different taste in stuff and that all fine, I just donated the majority of the Avenger / Hulk / Marvel DVD's to the library. Maybe someone will have more perspective than me. This movie halted it all on my side.", "The worst Movie I have ever seenIt just destroyed the image of the previous Avengers movies. It was simply waste of time and money.", "Don't.Yep, you heard me....Just don't. If you love these characters, were hooked on the previous movies, *don't.* If you deal with anxiety, panic, depression, or anything else, *don't.* This movie is not like the others, and honestly, does not show much screen time for most the characters. It is much more violent and emotional than the previous films, but more than that, it is extremely disturbing. Basically, if you feel obligated to view it for your favorite characters, just beware, there's not much screen time for them, so don't push yourself, or feel like you have to do it. Also, I would definitely NOT take kids to see this, as the movie has a very dark and disturbing atmosphere to it.", "Worst movie EverWhy did the producers have to keep the plot quiet till the end? Because it sucked! My kids love the Avengers, but I have since deleted all DVR recordings of them after watching this! Who in the world gave these jokes for producers money to destroy a franchise? Idiots!", "Not a very good movieThe main reason i'm giving this movie 1/10 is because this one doesn't deserve the current rating that it has(at the moment of writing this is 8.6, I would refer to other current movie ratings at the moment of writing this review). A rating of 8.6 means that this movie is as good as The matrix(8.7), Saving private Ryan(8.6), Memento(8.5), Interstellar(8.6) and also that it is better than Mr. Nobody(7.9) and Synecdoche, New York(7.5), etc.\n\nThis is the result of a movie with lots of fans who don't have any idea how to rate a movie and usually haven't seen much. at the most I would give this movie a 5.3, it is not so bad and it's enjoyable not memorable. Too many jokes and this is not a comedy, it doesn't seem to have a script not giving a chance for the actors to actually act.\n\nIn the movie they combine cinematography of some of the other movies related to this franchise, so in some instances the quality drops really low to the point you feel as if you're watching a really bad TV series, most CG effects are on point and sometimes not(the hulk buster).\n\nI personally don't understand who would give a score of 10/10 or 9/10 so easily to a movie no one will remember next year.", "No Spoiler Alert -But HATED The EndingOkay, plenty of action, lots of humor, excitement galore...so why the 1 rating from me? Because, and I'm not telling you one word about how it ends, this has to be the WORST way to end a movie I've ever seen...and wished I hadn't. The heck with it. Guess who won't be lined up to see how the next one goes? That would be ME 'cause frankly, at this point, I don't care.", "2 and a half hours of my life I can't get backWho wants to go to a movie when they feel worse at the end than they do when they come in? The ending ruins the film and tries to hook you into seeing part 2. I will wait until it makes it to the small screen. I won't lay down good money to feel bad. Nice effects but storyline just sucks. I can't believe all the high ratings.", "Not even an average 5, no way 8+Avengers: Infinity War getting anything above a 6 ratings destroys my faith in IMDB's rating system. Once I got past the first page of 10/10 ratings, the rest were 1, 2 and a few miscellaneous 5's. Four of us sat down to watch this movie last night and only two of us could finish it. I apologized for renting it and threw IMDB's ratings system under the bus. I kept waiting for something redeeming to happen, but it never did. The countless times I said, \"Well, that was stupid\" went on through the entire movie. Plot holes, lazy writing or whatever you want to call it were just constant. I will not wait through another 2+ hour movie in this series hoping for something redeeming to happen. Oh, and taking the red, white and blue away from Captain Am.., wait, what's his name again? Steve somebody. No, I'm done and whatever gaming of the IMDB ratings went on makes it of less use too.", "You can skip this oneI am not a fan. But I do like a lot of special effects and I do like to have fun while watching this kind of movies. However, you can easily skip this one. It is the worst part in the MCU series. People giving more the 5 stars just for the special effects? C'mon. This not how it is supposed to work.", "worse then ironman 2You know you can wrap a a pile of poo in pretty paper and bow but still a pile of poo and thats what this movie is sooooo disapointed", "Absolutely bored.Maybe I'm just getting massive franchise fatigue but I found the moving totally borIng. The story is linear, the stakes don't seem real by foreshadowIng the fact that they can change the past, and there's a LOT of backstory they fill in to get you up to speed on all 500 marvel super hero's from their various franchises that it's hard to feel emotionally engage. The power balance between characters strength and weaknesses seemed flawed. One character would be in peril from X weapon in one scene but then beat a more powerful weapon Y in another scene. Movies attain suspension of disbelief by setting and following rules. These rules seemed sloppily applied but all in all it wasn't as bad as Venom...", "Plot makes no sense. Mindless, meaningless actionBoring, plot makes no sense, characters make stupid choices, nothing is explained well. I don't understand how anyone can watch this and think that it's good. It did have nice special effects though.", "Literally the worst film everAbysmal and embarrassing cinema. The outcome of dumbing down and treating the audience as morons.", "stupid....he will win 100% Oscar for the worst scenario and for the worst director", "Don't waste your money on such a movie.The movie sucks! I almost left the theatre half through the show. This is not Marvel, this is junk!", "Uninteresting NonsenseThis movie amounts to a melange of violence against a plot of nothing. If you have an invincible monster exactly what can happen in the end.", "ScatographyAs I do with all Marvel stuff, I've loaded it onto the tablet I keep in the bathroom. The scenes are perfectly cut for some minutes in there. And it doesn't matter if you don't remember your last visit after a day or two, there's no correlation. Wether it's shapeless, explosive, dripping, ludicrous or misleading, it always ends with the feeling that there could have been more. But even if you try harder for another minute, there's only void. And as soon as you stand up, the whole stuff is flushed out of our memory. Only persists a reminiscence of nauseating miasma. Mankind seems to enjoy it. Well in that case, I've got a be an alien. I've decided to quit eating any fibre to never have to endure it again.", "2.5 hours of film with no content and no ending, amazing!Hollywood achieved a new high in quantity over quality: even more actors, even longer duration, even more special effects, even more chaos (incl. chaos on the script itself, in the sense of entropy vs order), and in the end it felt like a TV episode that suddenly ended just before you see what you were waiting for in the whole duration, to be continued next week, except that in this case it won't. Like 2.5 hours weren't enough to include an ending, so you have to wait for the movie industry's next release, obviously next year (as usual) to see what you were supposed to see on this movie.\n\nWatch the movie if you want to watch for 2.5 hours a completely uninspired, unintelligent and boring plot, been written by a group of writers who obviously were bored themselves in their personal lives, with all usual cliche and banal lines, a film that has nothing to say, and doesn't worth a dime either as fantasy, as science fiction as drama, or comedy. If you add them all, the sum is zero.\n\nOf course, you get a parade of popular actors that participate and serve that worth-less movie, and a series of computer effects. But a film is much more than actors and effects, it is supposed to have essence, inspired messages and stories that worth the time you spend watching, otherwise it's just an effects demo. You can watch many special effects demos on YouTube, on the cinema you are supposed to see a movie, not a demo. So if you want to go to the cinema, or rent a movie, better look for a real movie, one that honors the art of cinematography and you'll come out smarter, not dumber.", "The worst superhero movie ever!What kind of a superhero movie is a superhero movie if they loose? The directors just clearly wanted people to waste money in watching this piece awful movie so that they can again waste money in the next awful movie to get more money with Captain Marvel and Ant-Man. Why? They could have just introduced them earlier and could have made a could superhero movie. This is no way similar to the comics. For a big comic book like me who wanted to see the infinity gauntlet storyline being adapted in live-action ,this movie just ruined. And not just that why do these people show scenes in the trailer that are never in the movie.", "This is a overrated movie.I don't know how this movie IMDB High Rank. This is the very very very bad movie i have ever seen. This movie have no plot and story. Others marvel comic movie best then Averagers infinity war. Don't wast your valuable time in your life Believe me.", "Why this film souldn't be so well ratedI had to make a list of why this is so poorly made after seeing the film (I even made my account just to do this). It makes me really mad because it promotes bad films with a high budget, but i will try to convince you not to waste time watching it :\n\n1 - lots of scenes which don't add anything to the story, this film could be 1h40 long without any probleme 2 - fighting scenes without any tactic and where everyone waits it's turn 3 - fighting scenes scenes with explosions (is it supposed to be entertaining ? ) and no tactic, they simply punch and kick 4 - they give up stones too easely (which apparently could save the universe, but why do it ?) The caracters don't know how to make a choice 5 - The actors speak a lot but are not that good 6 - aside from the scenario, the film isn't even interesting visually nor the audio\n\nMaking more arguments is actually hard because this film is just about idiots fighting and \"jokes\" over and over My one star is to balance all theses undiserved good reviews, I personally think it should be rated with a solid 3,5", "Awful!Even if I overlook the Witzelsucht - the lame, inane attempts at humor - there are many other reasons to dislike this movie. Instead of expending the effort to portray the hulk longer than one moment, it actually upscales a little person. WTF? I will never pay to see another Marvel production!!", "Just a Popcorn movieIn this movie, the emotion is close to nothingness. However, the potential was huge.", "The worst movieNo history, too many heroes, and nothing with sense. Marvel has no writers", "No funHeros complexes x100... please change story. We have the same disk running for over a decade with hero movies please stop.", "Didn't like itI can't understand why you guys liked this movie, it's just superhero turmoil. Just can be watch to waste spare time. I must admit that movie's graphics are awesome but movie isn't made up just with graphics.", "NOTHINGS CHANGED (REVIEW FOR ALL MARVEL FANS)This review represents more than just infinity wars. This review applies to every marvel movie ever made.\n\nWhy I hate marvel movies Marvel represents everything wrong with movies from this generation .The marvel universe started off strong in 1944 with captain America which for the time was incredible. Than they started making movies that were aimed at adults such as the Blade trilogy and of cause the punisher which might I add I actually enjoyed. But than the sequels began to this day in 2018 marvel have filmed over 80 movies with an average of 9 movies every 2 years. If this doesn't show marvels true intentions than I don't know what will. Marvel is the most soulless repetitive money motivated film company of all time at this point you are literally paying for the same movie with a different repetitive costume 80 times 5 times a year. let's say you pay $10 for a ticket for every hardcore fan they have wasted $800 of there money times that by about 20 million fans you got $1600000000 going to a terrible franchise that just keeps ripping people off over and over. Than using money and theatre time that could be going to actual good movies. For example Quentin Tarantino's the hateful 8 was postponed for a later released because non other than marvel desided that they wanted to release there film a few weeks earlier. If movies watchers keep supporting these high budget plotless pointless repetitive garbage movies that keep Dwayne Johnson and marvel in business in a few years there won't be any good movies being made. Than we will all be thinking back to the 90s and mid 2000s when movies weren't money making trash and actually had plots and were more than a few good action sequences wondering what happened. The fact that avengers infinity wars is 49th place on the top 250 is disgusting and shows how close we are to the good movie irreversible apocalypse. There are a few good directors left and unfortunately they are getting old and only release 1 movie per few years such as Quentin Tarantino Martin Scorsese and Steven Spielberg. But lucky for us it's not to late just stop buying tickets and merchandise for marvel DC and any pointless action or dumb Adam sandler or Amy Schumer comedy and we might be able to save this planet from the great film Death.", "Badest movie ever!Story is scandalous. Too much heroes... you know what I mean. It really hurts during watching.", "Worst Movie EverLet me start off by saying I am a SciFi/Fantasy Fan, I love it.. it expands the mind and usually lifts the soul. But this negative soul ripping ride into depression made me so angry that I called where I buy digital movies from and got my money back.. first time I've ever done that.. I understand this is part one of a multi part movie, but *explative* after a hard day I wanted to be 'entertained' not pulled into a depression.. negative from start to finish, nothing but bad feelings. Superhero's are supposed to give hope and you'll find NONE here. In this day and time we live in the entire point of watching a superhero movie to see what a super hero is supposed to do. This movie infuriated me because it did the opposite.. you blew it marvel.. not as mad since I got to see it for free, but angry enough that I won't ever give you a red cent of mine again so long as I live for doing that to me.. you failed me at a time when I wanted nothing but a little entertainment, if I want something depressing that looks like fantasy I just watch the news. Marvel you suck.", "Absolutely awfulComplete downer movie. I can't believe I paid money and wasted hours of my life watching this trash. If I could go back in time and stop myself from seeing it, I would. I don't watch superhero movies to walk out of the movie MORE SAD than when I walked in!", "What a bad movie to be so popularTerrible CGI, so many plot holes, I almost fell asleep in the theater because of how boring movie was, all the characters going to come back so they can make more money off of this stupid franchise. Adventures infinity war is one of the most awful movies I've ever seen it is a cluster of characters that I used to care about, not anymore.", "MindlessIt's amazing how differently people react to the same movie. I read the accolades this elaborate bit of silliness gets and I just don't understand it. It's a mass of dazzle in its computer graphics but with a story line for low energy morons. The story belongs in a comic book for juveniles. It's nonstop action all right but with nothing else behind it: no story, no suspense, no McGuffin. A real waste of time.", "fell asleep watching this movieI was excited when i have seen fake 8.6 IMDB score of a movie.\n\nso i sat down and started watching.\n\ni was surprised how good was the graphics , but this thig that they call \"MOVIE\" is filming a green screen. you don't call filming a green screen a movie. this film had nothing to offer other than green screen effects. for 12 year old kids - this movie will be good.\n\nGod oh god how i was surprised when this 90% of green screen filming thing was rated above movies like \"Interstellar\" or \"saving private Ryan\"\n\nwhat is wrong with this world?", "How can this movie get so much praise?There is nothing but flashy images and superficial dialogues. Having a score of 8,5 is just an insult to the art that it filmography. Scorcese was right, this is not cinema.", "Death of the American Film MarketIf you like watching essentially the same movie being re-released every 4 months with a different character in a slightly different colour of spandex going through the exact same story arch as the last hero in an incredibly repetitive formulaic experience, then this is for you... If you like original, thought provoking movies that test you're senses and deliver new experiences, with strong well built characters, unique stories, excellent acting and ground-breaking directing... Then you won't like this. Another year, another endless array of comic book movies; there's a reason non of them never get nominated for best picture & it's not a good one.", "A lesson learned - don't take movie database scores/reviews on faith!Warning, this review contains a rant with lots of exclamation marks!\n\nOkay, so yesterday evening, my youngest daughter and I had some pizza, and were looking for something to watch on television. I couldn't find anything, so I looked to purchase a movie from one of the digital movie streaming websites. I looked on on THIS movie database (because I used to trust it), and with a score of 8.6 and so many initial 10/10 reviews, I went against my better judgement and purchased the digital copy of Avengers: Infinity War for £13.99. That's the last time I trust THIS movie database!\n\nI felt hoodwinked, and most definitely conned. This morning I had another look at the reviews, and observed that after the initial 10/10s, the rest of the reviews were 1/10. In retrospect, whilst this website perpetuates itself as having integrity in its reviews/ratings, it is my opinion that it is little more than a mechanism for generating sales for movies that under normal word-of-mouth conditions would tank. I feel so angry with myself.\n\nThe movie itself is a mish-mash of many different themes, and tries way too hard to be serious. I don't watch these movies for that - if I want serious, I'll watch Heat, Goodfellas or any other number of good thrillers. Why oh why would Marvel screw with the feel good formula of 'Guardians of the Galaxy'?\n\nTo sum up, it is my opinion that Avengers: Infinity War should have failed, but didn't - largely due to the manipulation of reviews and information. And I doubt very much if this interference of information was made for free!\n\nIf you believe the Avengers are a real, you might actually like this movie - everyone else will likely feel a little low. And to be honest, who needs that in this day and age? If you want to watch some misery, save your money and watch the news instead!", "It's all for the moneyVery angry after watching this movie. It's a trend, started by Netflix, now Marvel also sees a good money making formula to force people and Marvel fans to keep watching and buying the stuff. The formula is this: make a (potential) good storyline, use good actors and great cgi but then make an open end, ready for a sequel. I'm sorry but then there is no real satisfaction after watching the movie. Normally (especially) Marvel movies end well, the good guys win, the bad guys loose. In the old days you get a good feeling and have 2 hours of good entertainment. You can replay the movie back in your head and repeat that good feeling. No not any more, all for the money, more more, make (force) the people longing for the next episode. I'm ok with that with series, but NOT for movies. Movies need to have a satisfactory good end. That is why you watch 2.5 hours of movie. It's that I could watch this for free with friends, but in a cinema I would demand my money back. What would people say if you buy a book and there is no end, you need to buy another book for the end, it's the same thing. So that is why I rate this movie a 1, even though all my favorite Marvel characters are in, lot's of humor, super CGI and everything looks great for a 10 rating, until the last few minutes. It really ruin everything before it back to the lowest rating. Oh and please, it has nothing to do with that \"I don't understand\" the movie. I understand the financial reasons for doing this very well!", "Infinity War? No, infinitely disappointing. Don't waste your time!When I started watching this seemingly endless drag of a movie, I was expecting some of the magic that this franchise has had in the past. It wasn't to be. Instead, we got familiar character after familiar character, each doing their characteristic throw-away joke.\n\nNo drama was involved; at no time did I ever think any of the far-too-many stars that were involved were in any danger, or that anything bad could happen; it was all slight-of-hand, all CGI trickery that looks impressive when there's just a bit of it. Here were great heaping glops of it. Acting? None that I could discern, it was all throw-away lines from throw-away characters. These cardboard characters looked better on the cardboard box!\n\nAt first I thought of giving this piece of garbage a score of 2/10; but really, this movie is so very bad, and so damaging to the franchise, that a 1/10 is well deserved. It would be lower if I could make it so. This is a throw-away movie.\n\nVery young children and the extremely easily impressed by green-screen effects may like this film, but don't look for a plot or story; it's got lots of familiar faces though. It would have done so much better if it had a decent script-writer! Alas, that was not deemed necessary.", "worst piece of c***...everMind-numbing, give me your money for nothing, story what story, guess the number of celeb in... In short - lazy and bad, so so bad...", "BooooringI really tried to like this movie. I smiled and expressed enthusiasm. I bounced and nodded. I boned up on the Marvel universe. Finally the day came and I watched the movie. For some reason I was completely bored. One fight after another. Lots of stuff blowing up. Lots of people running around. Characters blowing up and running around at the same time. Is it possible I have become overstimulated by this type of adolescent entertainment? Believe me, my girlfriend and I have a better relationship than some of the so-called romance subjects in this hyped up disaster movie. I think I have grown up and comic book characters are no longer my role models. Oh well.", "Wash rinse and repeatThis movie sucked bad just like all Marvel it's a same thing over and over there was a couple good Marvel movies", "could watch something else for 2,5 hrsSpecial effects are good but I didn't want to watch video game effects, totally not worth it.", "A complete waste of 3 hours!Three hours of life I will never get back. Pure crap!!!!! Why do people like this garbage?", "This movie is messed up!Looks like Marvel got tired from the stereotype that they never truly kill their characters and they started to swing the sword left and right. The franchize went from no death to a freaking graveyard in one movie. So Marvel tried, but still MESSED UP big time! Peace.", "What a bad movie from marvelWhat a bad movie from marvel, it is not satisfying at all had many stars with a million place cutting off the story every 15 minutes.", "I fell asleep...If you are gonna watch this then do not waste your money, make it free, it is not worth £15 or $19. The whole thing was a big CGI fight and bored me to hell. Thanks Marvel. Thanks.", "What a Trash CGI comedy, Only 10 year old can like it.Marvel is known for its Trash CGI movies that only Kids can like. Its just bunch of Clowns flying around trying to be Cool.", "Mindless nonsenseMore mindless nonsense terrible cgi animation and no story of any interest. Kids dig this crap. We are encouraging a generation of idiots. Get back to making real movies Disney. You used to be so good at it!", "Not the greatest movie of all timeShawshank is nothing more than a fairy tale. It tells us as much about what prison is really like as Pretty Woman tells us about what prostitution is really like. People like fairy tales, so both these movies were very popular.", "An \"O.K.\" Movie, Worshiped Because of It's Accessibility.Shawshank Redemption has been elevated in popular opinion to the status of masterpiece because of one irrefutable virtue. It is accessible. Regrettably, as is true in so many cases, popular opinion is an inaccurate gauge of this picture's actual quality. The reason this film has attained its current level of acclaim is that it is impossible to misinterpret its theme or message, impossible to be offended by it, impossible to be confused by. However, as this review should show, it is entirely possible to be unimpressed by \"Shawshank.\"\n\nThe story of Shawshank Redemption is something I might expect if I was being pitched a script by middle schoolers. The complex coincidental frameup, the daring escape, the clear cut definitions of good and evil. the timeless friendship finally and uneventfully consummated on a beautiful shoreline. Each step more unsurprising than the last, each beat more clichéd that the last. Every time the filmmakers feel like building tension or revealing something about the characters, they take the most obvious road. This might be excusable if the road didn't also lead to the most obvious destinations.\n\nPeople also praise the acting in the film. While it isn't at all bad, it's hard to be impressed when the actors are playing such simplistic roles. Stereotypes when acted well are still boring.\n\nI sincerely hope that over time, when the film has settled into history and once people are more able to set this pandering film along side its heavily plundered predecessors, it will become clear that it offers nothing new, and that what it does offer it doesn't even offer all that well.", "ClicheThis film is nothing but one cliche after another. Having seen many of the 100's of prison films made from the early 30's to the 50's, I was able to pull almost every minute of Shawcrap from one of those films.\n\nWhile it is visually well made and acted, the story has every plot point of the \"standard\" prison film. They have the evil warden, innocent main character, friendly guilty guy, thugs and one good old prisoner. Don't waste your time on this one. Rent or buy some of the classic's of the prison genre.", "unoriginal prison movieThere are some things in this life we will never understand... How did the universe begin? What happens to our souls when we die? How did a movie as bland as The Shawshank Redemption become so overrated?\n\nIn the case of certain other movies, I can at least understand the reasons why they're overrated. But The Shawshank Redemption is so... average. And cliché-ridden. The film's moral is basically that hope is important, and there's nothing wrong with that in itself. Heck - I have no problem with simplicity. The problem is when you move past the simple and into the land of the simplistic. The movie treats its borrowed plot parts (Count of Monte Cristo, anyone?) and banal themes as though they were freshly minted nuggets of wisdom. (I wouldn't be complaining if it didn't pretend to be anything more than a pleasant diversion.) However, it is with its very last shot that the movie reveals its true condescending colours. If it had ended moments earlier instead, with that poetic shot of the sea, I would have had some respect for it (that's where the superior original story ends). But no, the director had to spell things out for his audience. Frank Darabont knows how to tell a story. He just doesn't know how to tell one with any originality or depth.\n\nThe movie is partially redeemed by three things. The majestic cinematography, the powerful score, and most of all, Morgan Freeman, one of the very best actors working today.\n\nAs for my rating, yes I'm one of those jerks who gives a movie a 1 just to lower it on the top 250. I think it's outrageous how highly it's ranked here. Even the folks who made it would think it's ridiculous to consider it one of the greatest films ever made.", "Most Overrated Film of All TimeSorry folks but this movie is a C movie and not an A. I can't believe that people like this movie so much. Yes I am biased, I really don't like Tim Robbins but he has made a decent movie or two but this ain't one of them. This is your basic prison movie. What can I say- it has the host of usual characters. The storyline is basic, the outcome I won't say but it is just stupid to say that this is a great movie. I didn't think it was realistic at all and anybody who falls for this crap is either delusional or needs some brains to differentiate between an Edsel and a Lamborghini. I wouldn't watch this movie again unless I was paid to do so. One viewing is enough for this predictable laugher.", "Didactic and overlongAnother one of those overlong morally right-on movies that never rises above average - saved only by the acting.\n\nIts bleeding-heart politics 'dignity of individual maintained in adverse conditions' is played-out well enough but actually lacks any real dramatic tension.\n\nDufrane is a two-dimensional character who seems to go through the drama by numbers - there's never any doubt that he will triumph in the end, it's only a matter of how.\n\nTim Robbins has done many more interesting films than this one - try The Player or Bob Roberts if you're looking for drama/moral ambivalence and how they interact.\n\nBasically, there are a lot better prison films than this one - Jailhouse Rock for starters.\n\nLike most Stephen King stories - quite prosaic. There was a story in here somewhere but it got over-inflated and somewhat lost along the way.\n\nOne to watch on a rainy day when there's nothing better to do.", "The plain & simple truth. It doesn't deserve to be at #2.just read the title. Tough I think it's a pretty decent movie (but not as good as the Stephen King's novel) i just can't understand why it should deserve to be ahead of everyone else in the top 250 (with the exception of the godfather). To be honest i don't even really think it should be in the top 250. Yeah, I know you Americans love the happy-ending Vaseline-flavored subtly homosexual jail movies, but all this hype it's too much anyway. Come on, this can't be better than Welles, Kubrick, Kurosawa or Scorsese (or not even Carpenter and Fulci in my humble opinion) So I give it a 1/10. This is not a critical valuation of the movie. This is a political statement.", "A good movie but definitely not #2 of all timeThis is certainly a good movie, with universal themes of freedom and adversity etc etc, but... I've seen plenty of movies which were more artfully made than this one. There is nothing revolutionary in the directing. The novella by Stephen King is practically tailor-made for a movie adaption, and it seems any capable director could have made a good movie from it. I think the only reason this movie is #2 on this list is the sheer amount of people who have seen it and voted. The other truly great movies near the top of the list don't pack the same mass audience appeal that Shawshank Redemption does, nor are they shown on TNT 6-10 times a year. Movies like 2001, The Seven Samurai, or Lawrence of Arabia, for example, would bore many of the people who love Shawshank Redemption, and I personally consider those three I named and many others to be far better creations than the Shawshank Redemption. Perhaps we should take a poll of TNT viewers on the best movie of all time - I'd bet Shawshank Redemption would place first, with The Blues Brothers coming in a close second.", "A sociopath prison warden, sadistic guard as well as cuddly and misunderstood inmates.Shawshank Redemption is overrated. It's a decent, above average film, but by no means a great film.\n\nThe inmates are pretty much likeable, while the warden and his pet guard are monsters. Also as Freeman's character says: \"You know that everybody in here's innocent?\" As the story develops you feel like he is right, the only criminals are the ones guarding the prisoners.\n\nThis is a sentimental piece made to stir the emotions, but not to stir them too much. Just enough to make the viewer feel there is injustice in the world but that in the end everything ends well and justice surely comes to he who waits 20 years or so for it.\n\nThe Shawshank Redemption is, as I said, a decent film, possibly among the top five films of 1994. IMO the best films of 1994 are Pulp Fiction and Léon.", "Sugary sentimental and unsatisfyingThis drama has been widely vaunted as one of the best films ever made- personally I just can't see the appeal. Sure it contains very good performances by Tim Robbins and Morgan Freeman- but there have been other, much better screen performances by other actors. There is very little suspense or originality about the plot and nothing that hasn't been seen or done on screen a hundred times before. So why the popularity? It's a formulaic feel-good movie who's happy ending is never in doubt. Knowing that Stephen King wrote the novel on which the film was based would probably give that away anyway. As with any adaptation from book to film there are several differences between the two, though the film does, on this occasion, improve on the book.\n\nThere have been better adaptations of King novels (The Shining) and better performances by better actors, yet for some reason this film continues to be rated as better than it actually is.", "Pale imitation of better filmsThree words: \"Cool Hand Luke.\" Same film, done better, done earlier. For that matter, is this film any better than other Steven King \"novelettes\" such as \"Stand By Me\"? All in all, it probably ranks a 6 or a 7, but since people on this site have lost their minds as regards this film, I give it a 1 in one man's attempt at sanity.", "my backlash voteSaying this is the #2 movie of all-time is like saying McDonald's makes the best hamburgers. They're both palatable, predictable, inoffensive products that are easy to digest. Both have happy endings-- that is, if you find the stunning speed with which a McDonald's hamburger flushes out your digestive tract to be a \"happy\" occasion.\n\nAll you need to know is that Shawshank has the exact same ending as \"Trading Places.\" So why not make \"Trading Places\" the greatest comedy of all-time?? What the hell, why not make it #3 on IMDb? It too is competent and utterly middle-of-the road in terms of quality and originality within its genre.\n\nInstead of Dan Ackroyd and Eddie Murphy laughing it up on a Caribbean beach after besting the forces of evil, we get Morgan Freeman and Tim Robbins. It's the exact same ending! Shawshank was OK when I saw it when it came out. But count me among the backlash group that would rather see it with the 6-7 rating that it deserves. Thusly, I hereby cast my symbolic 1-star vote.", "what is all the fuss abouti had to comment, i really did, all those eulogies on what is in reality a hackneyed complacent pretentious film. Nothing that this film says challenges any principle or thought- its purpose is to confirm every conservative, sentimental, instinct in us all. And yet it has a sense of its own putative profundities, and bulldozes these throughout the film. Really what the film is saying is neither profound nor original, and is not to my mind worth saying in the first place at least not at such length- ie life is hard, people suffer, but through struggle the human spirit will win through, learn to make friends and get their deserved reward - mmm. Nothing makes any of the characters real, and the actors are not helped by this terrible overloaded narration which applies a great weight on the story which cannot breath as every moment is made to seem sooo significant. It is not just that there is no lightness of touch in the direction, or that there is no humour, it is that there is a sense that what is being described is more important than humour, or than the real nature of friendship. Suffice to say i loathe this film and recommend people watch it only as a lesson in what is bad about big budget Hollywood movies.", "snarling critiqueawful. a dreadful disgrace. the film is the most cliched in cinematic history and is worthy of no respect. even worse is how it is so flawless yet it still is of no quality. i do not know how this film can be revered over others such as psycho, apocalypse now, raging bull, easy rider, the godfather, the killing fields, some like it hot and casablanca amongst others. shockingly horrendous", "After a big buildup, a real disappointmentAfter reading all the rave reviews for this movie, it turned out to be a real disappointment. Can anyone really believe that the prisoners are honourable men while the guards and warden are all \"crooks\"?? Haven't we overdone the hypocritical \"Bible thumper\"?? -- let's find a more enlightened characterization. James Bond, himself, could not have followed the main character's escape plan. The ending soliloquy and denouement were inferior plagiarisms from \"Cool Hand Luke\". Enough!!! Unfortunately, fine performances by both Robbins and Freeman were wasted in this \"fantasy\" story.", "OverratedIt's not a bad film. It's just derivative and melodramatic. It borrows from \"Cool Hand Luke,\" a superior film. It relishes its significance too much. It's a bit smug. Morgan Freeman's voiceover is a clumsy narrative device. I don't know -- I just know for sure it's not one of \"the best films of all time.\" Not even close.", "Impossibly overratedDon't get me wrong - I liked this movie just fine, I just don't understand how it deserves the *heaps* of rapturous praise it regularly receives from IMDb members, and the fact that is has been ranked at #2 in the hallowed IMDb Top 250 for the past 8 years or so just baffles me. It was certainly entertaining enough, and very well-acted, but also way over-long, and filled with the usual stock characters that seem to inhabit every prison drama (if Hollywood movies are to be believed, prison wardens are mainly just nasty SOB's and the inmates are just the best bunch of guys you'd ever want to meet). I'd recommend the movie as a good renter, but I guess I can't see it as any more than that. I realize I am way in the minority on this, however.", "unintentionally campy trash#2 favorite movie in the database? Mein Gott!! Surely you jest.\n\nBig-budget marquee name rip-off of the ever popular naif-in-prison B-film standard. Except the B movies don't pretend they aren't going for the shock/schlock appeal.\n\nUtter rubbish.", "Why?I don't understand why this movie is so popular. Yes, it was an interesting movie, and it was a good movie, but it was not spectacular enough to receive all the praise which it has. The acting was good, and the plot original, but it was still a rather ordinary movie. Apparently, I'm the only one with this opinion...", "Why is it rated Number 1?I don't understand how this movie managed to get to Number one on this site. While it's a good movie with talented actors, it's just not as entertaining and solid as other movies that i believe deserve the top ranking.\n\nI enjoyed watching it, and it really doesn't deserve the 1/10 rating I've given it (thats only to bring it lower on the top 250) it just isn't as good as other movies I have seen and loved such as 'Trainspotting', 'Pulp Fiction' and 'Donnie Darko' for example.\n\nThese movies are solid performances with a strong theme in one direction, while I feel that The Shawshank Redemption flounders around with it's, slightly lame, hope and friendship theme, thats just not as entertaining as others.", "Why does everyone like it so much?I'm sorry I don't mean to offend people who like this film but what on earth is all the fuss about over this film it is nothing compared to The Godfather and yet people vote it as second to the number 1!? The Shawshank Redemption has a relatively simple plot ,dull camera work the script is full of soppy language (thanks to the overrated Steven King)that just isn't particularly clever in any way.The atmosphere of 'prison' is totally unrealistic all the characters are wimps.The only good element is Morgan Freeman because he's a good actor.There aren't any clever twists-for instance the 'mystery' of what is in the box at the end of the film is really unoriginal. Please feel free to argue with me over this but come on people step back and look at the film what is it made up of? Then look at The Godfather look at what that is made up of - Brill cast, excellent plot, damn good script, good directing and camera work everything is perfect then look back at the Shawshank redemption its just at a completely different level. Its quite ridiculous really.", "The Most Overrated Movie of All TimeThank you Tim Robbins, you are the only reason I could sit through this long winded tale of garbage. As far as prison movies go, this suffers from an identity crisis is. Tries to do too much by not actually doing anything at all story wise. Watch Cool Hand Luke instead", "Cheap bigotryTim Robbins smirks his way through this cheap rip-off of the >\"Count of Monte Cristo\". The anti-Christian bigotry is too much >to stomach -- the murderous warden wears a cross, thumps a Bible >and utters fundamentalist platitudes. Morgan Freeman is very >solid tho", "What a bad movieThis is the worst movie I have ever seen. It's so Hollywood cliche ! How can this be in the top 2 best movies ever ? I don't understand it. Avoid at all cost, this movie is boring !", "sentimental garbageThere is absolutely nothing redeeming about this maudlin Hollywood package. The storyline is predictable; the characters and performances are one-dimensional; the dialogue is absolutely embarrassing (\"Prison is not a fairy tale.\" Ya think?!) If it would have been about women instead of men, it would have been dismissed as the schmaltzfest that it is. It isn't even courageous enough to admit that it is a gay love story. Tim Robbins should be ashamed to have taken part, for his performance was the most wooden I'd seen since Daryl Hannah in (insert any 80s movie she appeared in here). Morgan Freeman was even more dreadful and has been giving the same dreadful performance ever since. I don't expect much depth from Stephen King-inspired movies, but \"Children of the Corn\" was insightful in comparison to this dribble.", "Not a bad movie, but also not a very entertaining oneThe problem with this movie is that it is to ordinary. It seems like the movie is just a cheap feelgood flick that has an ending that is easily predicted. I didn't care much for the characters and the narration was pretty annoying. I've read the book and it's a good adaptation. See it if your a Stephen King fan or like Dramas.", "The bathos runs thickFor the life of me, I can't understand all the gushing about this cornball, sentimental and PHONY movie. There are certainly some strong performances, but they're outweighed by some of the two-dimensional portrayals, weak writing (that opera sequence -- oh, please) and most of all a completely garbage ending (I won't give it away) that stomps on what little credibility the movie has.\n\nI guess you really can't go broke under-estimating people's intelligence.", "I've never understood the love given to this pile of prison cliches.Yes, the leads are good actors, but that doesn't make the movie much better. I read an Esquire poll once that listed this as one of the male voters' top 10 movies of all time, and after the listing, Esquire wrote (huh?) couldn't agree more.", "It is the #2 film of all time but is it any good? No!!The Shawshank Redemption is a movie about a hotshot banker named Andy Dufresne(Tim Robbins) who is convicted of murdering his wife and is imprisoned in Shawshank Prison. He remains hopeful and makes friends especially with a blackmarketeer named \"Red\"( Morgan Freeman). I really don't see how this movie could possibly be the #2 film of all time, the movie is nothing groundbreakingly amazing, it is pretty poorly directed, the plot is thinner than air,there are no risks taken,and there is no thought provoked through watching the film that it only needs to one viewing to get the whole movie, in fact you wouldn't even need to watch the film to even understand how the movie is going end. The title already gives away the whole \"big\" finale of the movie. I don't see how anyone could possibly compare THIS to actually great movies like EVERYTHING that is below is on the Top 25. And the simple thought of this winning Best Picture back in '94, HAHAHAHAHAHAHA!, it would have given me somethingh to laugh at for the rest of my life, I still can't possibly see how the Academy could have even nominated this as the Best Picture of 1994. Anyway the only thing that saves the film of Morgan Freeman and it is only thing that even got me to see this film in the first place but it still can't stop me from giving this a poor grade.\n\n2/10", "if this film is #2 of all time, then i am Jesus Christ returning to burn this trashwow, how in the world is this film #2 of all time? Am i living in reality? hello? hello? can you hear me? am i actually a human being living in this world? hello? am i dreaming? there is no way in a infinite years that this film can be anywhere remotely close to being #2 of all time. maby the 99999999999999999999999999999999999999th film of all time, but not #2 of all time. no.\n\nthis film is for people who likes to be easily manipulated\n\nthis film is a joke\n\nthis film is so stupid that for the first time an object acknowledges its own retardation\n\n-revision 12/29/2009- Sorry about the above comment from years ago, that was not very mature. This movie is okay. However, it should not be rated so high, as there are more deserving films. I have to admit, this movie had no emotional impact on me whatsoever when I saw it. I find it interesting it was able to touch so many people. I still think there was a conspiracy to boost the rating of this movie.", "Number One?Really now. I can't say that this is the worst movie of all time, but it certainly isn't the greatest. The mere fact that TBS plays this movie sixteen times per week, thereby forcing you to watch it over and over again, does not mean that it is good. I therefore, call for a \"surge\" of negative reviews to be leveled against this mediocre film so that with the help of Mark Twain and his angels we will be able to oust it from its ill-deserved spot as IMDb #1 movie of all time. Honestly, my fellow Americans, this film is the kind of thing that makes us look bad.\n\nMerry Christmas, and to all a good night.", "Extremely overrated.Morgan Freeman gave a nice performance however Tim Robbins possessed no emotion whatsoever and I cared little if even at all for any of the characters. Not particularly well written with a warm message that is delivered over an overly long period of time.", "How could one movie be so terrible", "Boring.All the drama of a falling rock. If SK lived in the Victorian Age this would be a morality play--and both would be dead and forgotten by now--just the idea of it makes me want to live another 100 years or so.", "Weak copy of \"Escape from Alcatraz\"This movie is clearly a weak copy of \"Escape from Alcatraz\"(1979) The scene where Andy drops the grit is directly and without any effort from Frank Darabont to hide the fact that he has little fantasy, copied from Escape from Alcatraz. The sphere that is created in The Shawshank Redemption is meek whereas the sphere that is created in Escape from Alcatraz is thrilling and you can really feel the tension in the prison. The closed ending of this movie is for people, like Frank Darabont, that have little fantasy. The sublime open ending in Escape from Alcatraz leaves room for the viewer to fantasize on what happened to the prisoners.", "Ripe off of Escape From AlcatrazThis movie (Shawshank Redemption) is a pathetic ripe off of escape from Alcatraz and some other fine movies. kign even says he based the book on movies he saw growing up. if you plagiarise more then one source its still plagiarism. I thought the movie was decent until I saw Eastwoods movie, then I new itwas pure junk.\n\n\nsteals the characters - steals even the pet animal - steals his job in the jail - steals the method of escape\n\n\nShawshank Redemption steals everything but replaces Clint Eastwoods acting with amateurs. how Stephen King didn't get lambasted for plagiarism is beyond me. This must be something he only edited for his sack. I am sure most of the filming adding in these details and it doesn't even follow the book.\n\nI do not see how such a blatant ripe off is considered to be the best movie of all time by IMDb. It really takes away all of your credibility.\n\nBoth movies using a poster to cover a hole in the wall. There are just far too many similarities between the two movies for this to be accepted. If this was a university paper I would expect an expulsion.\n\nI guess they figure they can change the old mans pet from a bird to a rat and everything is OK. because that clearly changes the entire story.\n\nLastly no one in the movie was redeemed.", "I am so sorry to who likes this movie but...It is one of the worst movies I have ever seen in my life. Out of my top 5 worst movies this would be in at least the top 3 movies I hate. It is just so boring and everytime I turn on TNN or something it is on! By far one of the worst movies ever!", "A crowd-pleasing story with a message that comes off like a sermon.Aside from the iconic poster-on-the-wall scene, nothing about this movie is all that memorable.", "Everything rings falseWhy this film is so highly rated is beyond me. First of all, where is the redemption? The characters do nothing that can be construed as redeeming (except for the one played by Gil Bellows). They simply survive.\n\nSomeone who also doesn't like the film compares it to a fairy tale because it's unrealistic. This is an insult to fairy tales. Fairy tales are beautiful and deep, with complex motives transmitted throughout the centuries, the traditional good-bad dichotomy and a clear moral conclusion. The Shawshank Redemption is dull, with some basic and carefully explained symbolism (because apparently we're too stupid to get it otherwise) and, contrary to traditional notions of morality, the hero's sidekicks are some nice criminals. Of course, prison staff are cast as the bad guys and their boss is portrayed as a hypocrite speaking of the Bible yet acting in an un-Christian manner. Can you say anti-Christian bigotry?", "Theatrically beautiful, yet thematically shallowWhen I searched amongst the endless lists of reviews given about this movie, I had not found one that gave it less than 7 stars. In order to truly see a movie for what it is, one must look past all that makes it great into its minor flaws and weaknesses. If you (the reader) were drawn to this review because of the low rating, well I am sorry but I have mislead you. However, I have also led you to something greater and different from the rest of the reviews for this film.\n\nTo get to the point, Shawshank Redemption is magnificently made and deserves incredible amounts of praise for its entertainment value and perspective on life in prison. However, the themes of the film are rather shallow. The entire theme can be summarized in a short sentence: Friendship and hope can get you through almost anything. Although it is a great message, it is simply a nugget of what could have been much greater.\n\nNow I know that I have only given the film 1 star here, but that was only to draw attention so that you may finally see that this film, although superb, is not perfect by any means as is suggested by the vast quantity of perfect reviews. In all honesty I would give it nine stars out of ten and would encourage everybody to see it.\n\nGreat, not perfect, but after all, where can true perfection honestly be found?", "OverratedNot sure why this is on the top, it's a meh good nothing more, godfather has elements of greatness, interesting plot, dark knight undoubtedly has those but shawshank is a movie that can easily be forgotten, good performance from Morgan, but I really can't point at anything special.", "OVERRATED! I don't feel sorry for anyone in this movie!Shawshank is by far the most grossly overrated films of all time. To say that this is better than Lawrence of Arabia, better than Alien, Better then Saving Private Ryan, is just ridiculous. This movie is weak, as are all the characters in it. I'll never forgot the scene where the old man hangs himself after leaving prison and the piano symphony kicks in. Why should I feel sorry for him? Try living in Africa buddy and tell me how hard your life is. This movie is for weak people who love to shed a tear for prisoners and overall just weak people. Now I love the director of this and Stephen King, but im sorry, this isn't a masterpiece, it's forcing the audience into the characters emotional problems that few can relate. Go see the Green Mile instead.\n\nRating = D-\n\n\nVideoGameHollywood.com", "This movie bites!Okay so many people may be wondering why I hate such a \"beautiful work of literature\" or \"The best story ever told on screen\". Well there are too many reasons to list in my maximum of 1,000 words. So instead I will give a few obvious reasons on why I truly hate this movie. Being a teenager I enjoy movies like \"Mystic River\" and \"Donnie Darko\". You know psychological thrillers. Well this is nothing of the sort. \"The Shawshank Redemption\" is what I classify as a Sleeping movie. The name says it all. You sleep while you watch it. It took me about a month to get through the whole entire movie. That is very sad considering the praise this movie received. I pray no one else ever has to go through the torture of watching this horrid movie.", "Total waste of time.Well pure plain movie. Boring Dull No story at all. Plz I request all to rate 1 🌟 to movie so others don't waste their time by influence by wrong rating.", "The most over-rated movie in historySorry, but I don't get it. Below average movie. Why it gets all this praise is beyond me. Shouldn't even be in the top 100, let alone No. 1. Its not even the best Stephen King movie, I mean when you look at the likes of The Shining, Misery etc. There is no comparison. Don't believe the hype (you'll be disappointed)", "OverratedThe films is good I actually watched it multiple times as recommended by the reviews here. I just wanted to say, watch another film! Sure, The Shawshank Redemption is a great film but there are other great (possibly better) films, come on, be a bit more adventurous! I'll recommend you a title right now; The Cat in the Hat (2003)", "Not interestedIdk it wasn't as interesting as it was made to be. Not happy with the results.", "Most overrated movie of all timeThe movie was absolute trash. Horrible scripts, least menacing villain ever, no chemistry between the actors, and mundane story line. The movie was immensely over hyped and definitely does not deserve anything near a 9.3 rating. Its alright as a kids movie. It does not come anywhere near the unprecedented standards set by the dark knight or for that matter does not even come close to spiderman 2. The movie is often commended for its humor. In my opinion the humor is extremely dry and futile. Nothing special at all, despite its box office success it would have been better off as an animated movie. So if you want watch at least a decent super hero flick you might as well pick up Watchmen, X-men first class, Spider man 1 or 2 and of course the batman trilogy.", "A Very Good Movie....HoweverI have seen this movie and think it is very good, Tim Robbins is really good in it and Morgan Freeman as usual is great. It has a lot of original ideas and is deserving of much praise, however i really feel it lacks something that The Godfathers 1 and 2 have. They are just a different caliber of movie no offense to it, its very good. However Al Pacino in both of those films is as close to perfect of a performance as you will ever get. I really feel because it is 35 years old so many people of todays generation has not seen it, I am 20 and own all three and can appreciate the talent by Marlon Brando and Al Pacino in the first film and Al in the second with Francis Ford Coppola directing both. I understand that when someone sees a movie and they would like to rate it on this site its difficult to see all the other movies on the top 250, but when you are dealing with the top 5 its not that hard, see those movies and then judge.", "OkNot good as much of the hype they give for the movie so i dont like it", "really badi cannot believe someone would call this movie great i would give it a 3 but the fact it is the highest rating movie ever on this site makes me go crazy how pathetic can this be this is the most overrated movie ever created made with a low budget it seems all that happens is a guy that went to prison gets raped several times escapes and meets his friend from prison back when he was out ending 99% of the movie was made in prison where all that happened was he gets raped and washes some clothes seriously how can you even compare this near to godfather dark knight etc? ...and the bad director just killed himself at the end his wife gets killed he isn't even sad about it 20 years in prison has some money not that much and is happy how nice", "so badI cant even summarise how much i hate this film its terrible have a bad day", "trashThe most over rated film of all time, riddled with plot holes and plagued with sloppy scripting. Not terrible, but not worth watching unless you have a morbid curiosity to see what the fuss is all about and certainly not worth a second viewing.", "null movieThe movie revolve around null,so it is based on null and some order of alphabet", "The most depressing movie I have ever seen.I was recommended to watch this God-awful movie.I watched until the end. By God I wished I hadn't. It really was, undoubtedly, the most depressing film I have ever seen.", "Overrated and overhypedOverhyped socialist movie that tried to convince me that prisoners are better people then us and deserve much better treatment.", "One of the Worst \"Films\" Ever Made!This is honestly one of the worst movies that I have ever seen in my life! Everything about it is a step down from the book! I much prefer the Stephen King's genius novel because it has nuance, charm, and is told in an actually engaging way.\n\nThe film, on the other hand, is a complete mess and has no idea what it wants to be. The story follows to many characters, but not in a way that makes it seem interesting or smart. It can't decide which character it wants to tell the story from. In the novel, the story had many intriguing surprises because it was told through Red's point of view. In the film, the story shows too much of Andy Dufresne and ends up detracting from the story and his development as a character.\n\nEven the music is cliche, uninspiring, and thinks it's much more important than it actually is. In one specific scene, the music ends up draining the scene of all possible emotional weight or significance because it draws attention to itself in a way that it feels more annoying and loud than heartfelt and sincere.\n\nThe color palette is also dull, drab, and lifeless. It only makes viewers want to watch this film less and takes any enjoyment or humor/happiness from the characters away. The acting is also poor and unsubtle. Morgan Freeman has the only few scenes where the acting isn't God-awful. If only the screenplay didn't take out all of the nice, smart, and engaging parts of the novel and replace them with cliche, dull, useless things in the film, this could have been a mildly entertaining/enjoyable watch.\n\nPlease do not watch this film if you haven't already or if you value your time and great cinema.\n\n1/10", "No comment.I was expecting something else entirely to a better movie. Sorry not impressed me so even give birth. The only thing I liked was how they interpreted actors.", "'Stir Crazy' did it better.This movie was inspired by the brilliant Stir Crazy starring Gene Wilder and Richard Pryor. As an essay on prison life, Shawshank Redemption fails on every level that Stir Crazy managed to succeed on.\n\nShawshank is nowhere near as funny as Stir Crazy. There is not a woodpecker suited bank robbery to be found. There is no Grossberger, no homosexual black man hassling the heroes, no silly mania scenes. There is nothing here that even remotely comes close to emulating its predecessor.\n\nThe obvious links to the original are still there: Morgan Freeman in the Richard Pryor role and Tim Robbins as Gene Wilder. However, Robbins and Freeman are nowhere near Wilder and Pryor in the acting stakes and we end up feeling disappointed at their lack of conviction (no pun intended) in the roles.", "AwfulThis movie is terrible the worst I've ever watched bruh not worth a penny!", "its badShawshank is bad film . shawshank dont have sense . i dont like characres and film dont have story for make .", "Pathos galoreToo sentimental, too pathetic, too slow, too conventionally made, and the voice over explaining everything ruins it completely, making it boring as hell. By far the most overrated film of all times.", "BoringThe movie is about an accountant who is accused of murdering his wife and her lover and as a result is sentenced for a life in prison. The movie is filled with deep meanings but unfortunately it is very boring and directed in a very lame way. Plus the musical score is preety bad and does not spark any emotions from you. In this type of movie an emotional and memorable musical score is very important but somehow the filmmakers did not seem to care.", "A good disk for a scrap-booking projectThis is good example of how to not to make a movie. It begins quite dry. The main character doesn't seem like he quite knows how to act as he is thrown into a poorly lit scene in what seems to be the director's garage revamped. He then goes to prison. NO SENSE WHATSOEVER! Obviously there is a huge paradigm between what the director though the film to be and the original writers.\n\nWe then see all of what we normally find in prison, with a very fatal exception. NO MINING! I am a personal favorite of mining in prison. I love to see people smash rocks and burn coal for fire. We mainly find dry dialog from what appears to be actors who have never left their parent's basement (no wonder the director still films at his home). I had to leave the room a few times so that I could get some fresh air while the movie attempted be filmed.\n\nMy advice is to buy this film only if you need a DVD or VHS tape for a scrap booking project. The reflective qualities are very nice and the packaging insert can also be used to store a home video. Be sure not to allow the label to be visible, as that may cause your friends to disown you forever.", "Number one. Really?No, I refuse to understand why this undoubtedly very good film is considered by many to be the best of the best. I would not be surprised if this film was in the top ten, but I can not accept the fact that for people this particular topic is the main one. The theme of the film, in two words, is freedom and hope. Indeed, these are the most important concepts in life, but I reviewed this film many times, and with all my desire I could not say after the credits that this movie revealed these words in full. The popularity of this film, or rather not even popularity, but a high rating and high ratings, is primarily due to the herd instinct. That's all.\n\nI do not agree that the theme of freedom should be shown precisely on the example of a prison. It can be shown like this, but then I can't call it brilliant, and the rating obliges me to do it. But I will never say that this movie is the best.\n\nAll those who consider the topic of release from prison the most relevant for themselves, have you all been sitting there? They will answer me: 'meaning inner freedom' and all that. But nevertheless, you consider the prison-themed film to be the best film about freedom... The film 'Braveheart' reveals this concept much deeper and more extensively, but the struggle for the freedom of an entire nation is apparently placed lower than this very struggle of a single person.\n\nIn conclusion, I would like to emphasize that I am by no means trying to criticize the film as a project. I just want to say that he should not be in the first place in the rankings.", "Sentimental crapSentimental crap! Boring, over-rated beyond belief! Don't watch it-it's crap!", "OverratedI've gone back and rewatched this film after everyone rated it so highly. But I still can't see what the appeal is. It goes on and on but nothing much happens. Watching it started to feel like a prison sentence. I certainly won't be going back in for a third stretch. I'm happy to accept that I'm right and you lot are all wrong. To all those giving it a perfect score, I say try watching more films.", "boringPrepared to be bored. i disliked this very much. zero thrill, zero meaning.", "Overrated !!!This movie is the most overrated movie of all time. The beginning of the movie is disgusting. Then it passes slowly , slowly , slowly ! .. There are no events !!! only a bunch of people in prison talking to each other.. that's it !! The movie was boring and long.. I mean very boring .. If it was not rated as 9.3 I would just stop watching the movie. But because of the high rating and all the fuss about it I just continued watching it. The ending was absolutely hilarious ! Common !!! a very funny twist that was predictable. But the way they presented that twist to us was hilarious ! Believe me , don't watch this movie, it is literally overrated. If there was zero rating, then this movie deserves it !", "didnt like itThe GMOAT?????? LMAO Prison dramas are a dime a dozen what makes this different from any other prison drama?\n\nIt is unoriginal and cliched.\n\nAnd I dont like Stephen King.\n\nHe wrote a horrible little story called IT.", "EhIt was okay I mean like yh it is what it is I guess", "PoorThis is the worstest movie i have see tyfussyhdtjigfd", "Not at all the best movie.. But maybe in the top10I've seen a lot of movies in my days.. This one was fine, but not the best. A movie should keep you entertained, not make you think - \"When is this going to END?\"\n\nDid not deserve to be N1 in IMDb. All that surrealism, mostly boring in parts even disturbing. Maybe few of you will enjoy it, but I think it would be better if there was more done in less time rather than the opposite. The same old stuff happens, like a soup opera. You like it in the binging, you say to your self - \"This will be good, IMDb was right.\" but an hour later you think \" Yeaah, been there done that, lets turn it off..\".\n\nThink about it, was this the best you've ever seen? No?", "disappointingIt's really hard not to write an angry review! I can't believe this movie is number 1 on IMDB. The story felt so fake that it was impossible for me to get into it. And the aesthetic of the movie is really not interesting. So many movies are better, this ranking is absolutely absurd ! This movie should not be number one, it's shouldn't even be in the top 250!\n\nThis movie brought me nothing but deception.", "It's the worst I've seenOld directing, cliched characters, bad dialogues,The main character tries to be perfect but goes towards vulgarity and unrealism,And it's longer than it's worth,not for me .....................................................", "Shawstank overratedThis movie sucks a.. and is as boring a film that's has everything been made period", "terrible movieI HATE THIS MOVIE WASTED SO MUCH TIME WATCHING IT WHEN COULD BE WATCHING MEMEUMOUS FACE REVEAL", "Fantasy tale.This movie takes place off in fantasy land somewhere. Absolutely ridiculous. Anyone with a brain who knows how the real world works would not fall for this fairy tale. Go watch \"Escape From Alcatraz\". That's what this is ripping off so badly anyway. Alcatraz is the original. I did almost add an extra star for Tim Robbins though. You look beautiful darling!", "BoringWithout a doubt, the most boring movie I have ever seen. Why this is one of the top movies of all time is beyond me. There's just nothing there, too much talking about absolute rubbish. The characters are boring, the story is boring.\n\nThe time I wasted watching this, I could've watched some paint dry instead. This movie and every copy of it should be destroyed and it should be illegal to talk about it, honestly it's that bad.\n\nIf I'd of seen this at the cinema, I'd would have asked for my money back. Not worth anybodys time or effort. Yes you guessed it, I think this movie sucks.\n\nNothing more to say....", "Pathetic. Glorification of worst criminals as heoes.Morgan Freeman voice is irritating. I dont know why he was selected to this movie, Robert De Niro would be much better.\n\nThe movie is full of improbable scenarios. First, I find it hard to believe that no other prisoner wouldnt notice his digging during nights. And we know he must have done the digging during night.\n\nSecondly, such long tunnel as illustrated on the movie between cell and utility corridor wouldn't be possible, as there are no such solid walls. Thirdly, if he escaped he wouldnt be able to put poster on the hole properly, so guard would spot the hole when he entered the cell. He didn't spot it, so it makes the plot unreliable.\n\nOverall very poor movie, particularly the ending. If you want real piece of prison movie, watch The Glass House, The Glass House or Hole. Shanshank Redemption is overhyped movie that doesn't stand realities.", "exaggerated movieThe movie is definitely exaggerated. there are better ones than that. this is ridiculous. the evaluation results are troubled.", "BestText: 101/10 best movie evar, epic win dub to be had every time I watch. I like this more than fortnight. NFS hot pursuit is bad. CATH is good movie plz rate 10/10 for GM the man in the sky said so Yeah yeah that's fine I'll just send you the money pill and then I will have it for me tomorrow and then I will have it for tomorrow for the rest of the week and I'll let you get it done, I hope can give it back for tomorrow thank me again love yours truly. Summary: Best head", "Interesting MovieI Like this Remember Red, hope is a good thing, maybe the best of things, and no good thing ever dies.", "Don't watch!Absolutely horrible movie don't watch :( I bought this to my son and we watched it it was absolutely horrible I am giving a dislike", "A film for the Idiots !!Frank Darabont is no Orsen Welles. This is a manipulative piece of garbage which has successfully fooled many people.\n\nDONT BE A SHEEP !! THIS IS A CRAPPY MOVIE ! PERIOD !!!", "Not bad, but oldNot bad, i liked the film however I would say you can tell that it is a film that is almost 2 decades old in the quality and in the plot scheme.", "DepressingVery very weak. There is practically nothing in the entire film that surprises us in any way. If the purpose of the film was to be edifying, frankly, I saw nothing useful, neither moral nor spiritual. And it's not because I'm hard at heart; on the contrary, I have a good heart and high conservative moral values. But I finished watching this movie and I felt me depressed and upset by the waste of my time. In fact, I already got used to not giving credit to the high ratings of IMDb users.", "I did not care for itThis film concept does not attract me. The plot does not seem interesting.\n\nThank you.", "One good thingThe movie seems to have gotten such a high rating, it's totally awesome. What should I say that no one else has said before? It's the story, the premise, but most of all, this movie is about how you feel. Sometimes you watch a movie and you don't remember it days later, this movie loves you with you, once you watch it, you don't forget.\n\nEveryone who has to watch Shawshank may be so jaded of the film's title, or how a 1/2 hour movie set inside the walls of a prison can manage to tap the soul of such a wide range of people. Shawshank has not one explosion. I wonder if it even has a single special effect or digitally- enhanced frame.", "This a awesome movie I have ever seen.This is an awesome movie I have ever seen. The movie is pretty old but, the old is gold it seems in here. This is sort of prison break but the way it's been done is terrific. I am not too fond of the Tim Robbins, still he was really just the center of attraction\u0085. I think everyone should watch the movie, even the young stars as well. In my views the character Andy Dufresne was a perfect manipulator and planner, and a good friend as well. I mostly liked the chemistry between Freeman and Tim, the way Tim left some stuffs for freeman, might be needed for to go forward. And after a long time how a prisoner has become habituated with loo permission.\n\nThe evens were not surprising, but the way it was reflected was tremendous. I admire this movie and all-time favorite, I watched it for almost 40 times, still fell like watching once again.", "Very OverratedMovie is Too long ... it does have an ok story & A good message but that is it.", "AhmedsharifkhannoorThis movie is so boring. Actor don't know what hell they are doing.", "great...Why do I want to write the 22234th comment on The Shawshank Redemption? I am not sure - almost everything that could be possibly said about it has been said. But like so many other people who wrote comments, I was and am profoundly moved by this simple and eloquent depiction of hope and friendship and redemption.\n\nThe only other movie I have ever seen that effects me as strongly is To Kill a Mockingbird. Both movies leave me feeling cleaner for having watched them.\n\nI didn't intend to see this movie at all: I do not like prison movies and I don't normally watch them. I work at a branch library and one day as I was checking The Shawshank Redemption out to one of our older patrons, she said to me, \"Whenever I feel down or depressed, I check out this movie and watch it and it always makes me feel better.\" At the time, I thought that was very strange. One day there was nothing on TV except things I absolutely would not watch under any circumstance or things that I had seen too many times already. I remembered what she said, so I watched it. I have watched it many many times since then and it gets better with every showing.\n\nNo action, no special effects - just men in prison uniforms talking to each other.\n\nThe Shawshank Redemption and To Kill a Mockingbird) are the best movies I have ever seen. I do not judge it by it's technical merits - I don't really care about that. I have read that Citizen Kane or The Godfather or this or that movie is the best movie ever made. They may have the best technique or be the most influential motion pictures ever made, but not the best. The best movies are ones that touch the soul. It takes a movie like The Shawshank Redemption to touch the soul.", "The Equivalent of a Gourmet CheetoThe Shawshank Redemption is undeniably well made, like a Gourmet Cheeto. But it fails to satisfy because a Cheeto, no matter how you dress it, is just a Cheeto. The problem is that this movie wants to be two contradictory things that end up canceling each other out. On the one hand, with its superb cinematography, excellent score, and 2 hours and 22 minute runtime, The Shawshank Redemption wants to be epic in scale and make a serious statement about the human spirit. On the other hand, it too wants to be super accessible, with characters straight out of the pages of a comic book, watered down philosophical observations, and impossible to believe scenes, like the one in the prison yard, where the inmates are awestruck by the opera coming out from the PA system as if they were hearing the voice of God himself. Clearly The Shawshank Redemption wants to have its cake and eat it. It wants to be very intellectual but very accessible at the same time. In the end, what you get is something that looks like the real deal, but feels hollow inside, like a Cheeto. The thing is, the world is in love with Cheetos, which are overrated. Just like this movie.", "Overrated, long and boringMaybe the film is too old for my generation but I just found it boring, predictable, overrated and long.", "OverratedNot sure what kind of message this movie is supposed to send. Or is it supposed to be just fun, because it's not. I don't sympathize with the main character at all, throughout the whole movie he would get on my nerves. I was waiting entire time for the plot to start revolving and when it finally did, the movie was over and left me with a feeling that I've waisted two hours of my life on nothing. For a movie with this high rating I expected to see something fresh and inspirational and somehow it seems to me all the scenes and acting I've seen in this movie I saw a thousand times in bunch of other movies, like it was cliche after cliche. Yawn festival.", "I feel like everyone is brain washedI thought this movie was complete and utter garbage. I don't understand why people liked this movie so much. The character doesn't even stay true to the comics and the director flat out said it didn't, and then they made it seem like it was part of Gothams fall and he was just a little boy that had a laughing problem... Hated it", "MOST OVERRATED AND OVER HYPED FILM OF ALL TIMEThe hype the movie generated did absolutely injustice to the film. The actor did a pretty good job but the screenplay and story is too much boring. The first half its bearable but the last half really let down the film entirely. One of the worst films ever to get such a huge IMDB ratings ever.\n\nWasted my 2 hours completely.", "Artificial UprisingThe whole point of this movie is to bring attention to mental illness (I'll do you one better and name a bigger issue than mental illness that the film barely focuses on; the lack of quality mental healthcare) but the film completely discredits its own message with a one dimensional depiction of most of the world and characters that inhabit it. It seems that Gotham and its citizens (the entire universe for that matter) only exists to put Arthur down and considering the film isn't told from Arthur's perspective, it is a blatantly stupid depiction of the world. The reason why people liked it so much is because the sad corporate slaves (especially the youth currently being indoctrinated) were subconsciously tricked into believing they were part of some bigger cause when they were really just sitting in their comfy chairs.", "Seen it twice and it still sucksDidn't enjoy this in the cinema and I didn't enjoy it at home. It's not saying anything coherent about how we treat mentally ill people or what a coarse society can do to a person. The story is Nonsensical and relentlessly grim and, while I'm willing to suspend disbelief enough to buy a man in a bat suit, i can't suspend it enough To believe a person like fleck would be treated in the way his is treated. Am also meant to believe this guy is a criminal mastermind? Or perhaps that none of it happened except in his head? Whatever. It's pointless dross. People who think this is great clearly don't watch many films.", "IdiotThat should be the title, the worst possible situations solve the worse way possible, over and over, and this what people like? no wonder the World is the piece of crap that is today and going worse by the day, we deserve to be extinct.", "Joke's on YouThis film is about mental illness. Specifically, a mental illness called creative diarrhoea.\n\nSeriously though, there is sooo much wrong with this movie. I won't even start with how I knew that a Joker sob story had no hope of (artistic) success, nor with why I went I went to see it anyway. I'll start by pointing out other reviewers' observation that this is not even the Joker. He's not suave, he's not witty, there are no lethal gimmicks, no morbid jokes, no anarchism, and he isn't a criminal mastermind. He's just a loser that goes off on a school shooter streak.\n\nSecondly, this is not, as I said earlier, a film about mental illness. It is a mockery of it, cashing in on the increasing awareness about mental health. There is not one concept about psychosis or other mental health problems judiciously explored in the movie (an illness which causes the sufferer to laugh in inappropriate situations? Seriously?!). All you're getting here is a downtrodden loner being subjected to beatings and injustices designed to spark indignation in the viewer, then going off on a murder spree.\n\nWith regards to the much-praised acting, it's a mystery to me how anyone could have come to a judgement of Phoenix's theatrical achievement based off such an asinine script, because I can't. Not that you should devote an iota of attention to any of these positive reviews, because I'm fairly confident that there is some large-scale review rigging going on.\n\nThe plot is one dimensional and juvenile, the dialogue as engaging as a monotone nursery rhyme and the character development shallow. There were goofs left right and centre, like revolvers with zero recoil and 8 bullets. Why did Arthur keep dancing? Why did we need to see Arthur fondling himself? Why is he so emaciated? Why so much smoking? I watched so many close-ups of cigarettes burn out it makes me wonder if the film was sponsored by the tobacco industry.\n\nThe two positives in the movie for me were firstly, the final talk show scene, littered though it was with imperfections like the rest of the movie, which did have me sitting a little less slouched in my seat. Also, there were some interesting theories presented tying the Joker with the Batman.\n\nWith the bar set so high by The Dark Knight, no director seeking artistic acclaim will go near the Joker for many years to come, maybe ever, but on the other hand, the Joker character has been rendered a boon for Hollywood opportunists, and this is the second time we've seen the character butchered in a low effort high budget money maker. This one will be forgotten quick, but I don't know how long it will be before the Joker himself recovers.", "Murdering the JokerThis film tries desperately to devillify the most stylish and charismatic villain in the DC universe and excruciatingly transform him into a poster child for mental illness in the most tedious manner possible.. This version of the Joker lacks any semblance of style, luster, flair, or charisma, leaving me to wonder why anyone would bother investing the time and money required to create this turkey, much less watch it.\n\nThey've murdered the Joker for the sake of some social commentary and PC promotion. I don't deny that mental illness is a real issue or that attention should be brought to it, but folks watch movies about supervillians to see super-villainy, not a 2 hour public service announcement. I hung in there as long as I could hoping for this movie to redeem itself, but about 3 quarters of the way through I could take no more of watching it spin it's wheels.\n\nIf you are a fan of the Jack Nicholson or Heath Ledger versions of the Joker then you will likely find this film as painful to watch as I did.", "2 hours full of bad , bad mood.Joaquín Phoenix's unconvincing laughing, and looking like a beaten dog had brutaly ennoyed me after 5 minutes.\n\nThe world is mean and bad, and you can only be bad and hit back. Chaos, anarchy, whatever .. all inspired by a clown who killed 3 bullies.\n\nMore of this stupid excess of brutality in the name of... what?\n\nYes. It is the same director as in the hangover 3.\n\nI don't want to be a partir of this.\n\nBrutal and boring.", "Garbage hypeI have never left a review for any title, good or bad but this is such a piece of garbage that I registered an IMDB account just to vent my opinion. I want these 2 hours of my life back", "Extremely pointless movieRatings for acting are overrated. This movie is terrible. I watched a man smoke 112 cigarettes and do a fake laugh for two hour", "Who's the real joker?I don't understand the high ratings. I went to the cinema with high expectations, only to discover that the movie was slow as anything and was almost finished before the first killing happened. It was a dreadful time having to wait for something to happen. But yes, once the movie was finished and I finally walked out, I got the cosmic joke; I was the joker, trusting the reviews and leaving disappointed in disbelief I actually paid for watching it.", "just a joke,the movie.I'm keeping it short, the movie sucks.\n\nYes, I know there's a need to build character and crap, and I think it's important for any good movie.\n\nSame goes with this, I get it Joker was a troubled man, I get his frustration, but I don't need 2 hours of the movie telling me the same crap over and over again.\n\nGive the guy an Oscar for performance but throw this movie into the trash right after.", "Glad I didn't waste my money on this movieI was very excited about this movie when it came out in theaters and after all the raving reviews I was even more excited. I never got a chance to watch in the theater and I'm very glad I didn't. This movie was 2 hours, that felt like 4, of flat boring plot. Literally nothing happens in the movie. All it is a very mentally ill insecure man talking to a therapist, laughing, and killing people. Arthur's laugh is terrible and annoys me throughout the whole movie. Arthur has no depth or personality. This movie was so boring I started falling asleep. Anyone who things those movie is a deep and meaningful masterpiece clearly has not seen other movies. I can list off so many other movies that are much more moving and deep than this. All this movie does is try to show that the villain, The Joker, from the comics is a distraught weak man. But in reality the joker from the comics is anything but that. He was crazy but a compete mastermind. The 11 Oscar nominations are idiotic because this movie is anything but Oscar worthy.", "No.. Just... no.I'm making sure to give this movie 1 star because it's definitely not a 8.9 - that's a lie.\n\nJoker is not an amazing movie. It's far from great. More to the boring side.\n\nIt lacks plot twist and focus too much on character development. How many times someone needs to get punched in the face before they go crazy?\n\nHe suffers, gets fired, has a mental illness, nobody loves him, he's sad and he cries and he laughs and he laughs again. And he kills some people, and that's it, that's the movie.", "This movie is so bad i wonder if the 10 star ratings aren't being paidThe one star only goes to reward the performance of the main actor. That's it! The rest of the movie is really just ... nah ... I really was expecting an amazing movie according to all the reviews ... but really, it - does - not - make - any - sense. What in this movie makes it so different that it deserves a 10? On average, users would review that a 6 or an 8 at max. So i wonder if there hasn't been a scam somewhere telling people: \"Put a ravishing review on Joker and you'll get an iPhone for free!\" The movie is very slow, very repetitive, not surprising, dragging, stupid (Joker seems to be 50 while Bruce is 10 ... So when Batman arrives, is he fighting a septuagenarian ???!!!) ... and dare i say, unoriginal ! All in all, boring!", "Don't waste your time or moneyIf you plan on watching this I would suggest skipping to the last 20 or 30mins. Otherwise it's completely boring, I thought people were saying this was suppose to be better then Heath Ledgers joker? Not to say this joker doesn't have potential but they just spent 90% of the movie showing that he has a mental issue.", "The ego project of a severely stupid manAbsolute trash film. Misses all the key characteristics of the character and replaces them with a bunch of edgy, brain-dead, baby's first \"social commentary\" that doesn't say anything coherent at all. This is a terrible film.", "Good for TV Cable onlyI was boring in cinema, just good marketing and promotion", "Horrible job of portraying the characterIf it wasn't for the title and make-up, you wouldn't know it was based on the comic-book character. First of all, the real Joker is not a weak and unconfident pushover. Not even in his genesis stage. The real Joker had a high tolerance for pain, could fight and was intelligent. Which made him dangerous due to his insanity. When Joaquin shoots the guy on the subway, he does it out of cowardice. They try to make up for it with the Murray shooting scene. There is no way that Joaquin's Joker will ever fill the shoes of the badass Joker in the comics, not even the different incarnations by different comic authors....and just forget about even coming close to Heath Ledger's portrayal. They should have just called the movie something totally different and forget about trying to make the connection.", "I really don't understand.Joaquin Phoenix is good. The directing is pretty good. The writing is absolutely awful. This movie is trying so hard to be relevant and to have a 'message' that it just throws a jumbled mess of quasi-commentary at you hoping something will stick. It is completely unclear what exactly writer/director Todd Phillips is actually trying to say, if anything. Is Joker a hero of the resistance or is he an incel? Does he go crazy because he's mentally ill or because people are mean to him? Both rich people and poor people are horrible to Joker so what exactly is the class commentary? It's also confusing how Robert De Niro when this movie is clearly ripping off Taxi Driver in many ways, also with a little Mr. Robot thrown in. There's also a subplot with a neighbor that is so incredibly stupid and pointless, which actually has no bearing on the story whatsoever. The movie is also just listless and boring throughout much of it. A movie can be slow-paced without it being boring if interesting things are happening that are driving the plot towards it's conclusion. The only thing driving the story in this movie is knowing that he's going to become joker at some points, not anything that actually happens in the movie. The movie also spends like 5 minutes making fun of a little person for no clear reason. Also for people saying that this movie does a good job saying why you should be nicer to people especially if they're lonely or have mental health issues: firstly you shouldn't need a movie like this to be nice to people, secondly you can make a movie like that where the lonely/mentally ill person doesn't become a murderer since mentally ill people are more likely to be victims than perpetrators of crime, and thirdly if you want a movie showing why you need to empathize with criminals why not movies about all the people of color who have been victims of mass incarceration and were locked up on nonviolent charges instead of a movie about a white male becoming a mass murderer. This movie is terrible.", "This movie is ridiculous and has no complexities that make a movie great", "Great acting - Terrible filmI was so looking forward to this film given all the hype about brilliant acting etc but yet again what a let down!\n\nThe film had no real storyline in the past or the present and although the acting was brilliant I had real trouble understanding the plot, if at all there was one.\n\nONE STAR IS FOR THE ACTORS", "I get it - didn't like itYes, the acting was superb, and a lot went into the creation of dark ambience...\n\nBut... it was NOT an entertaining experience, and left me with a feeling of ...meh...\n\nWe are not \"insiders\" who react to the technicalities, we are an audience to be entertained.. so, it failed for me!", "Overrated and boringOne of the worst movies I have ever seen. Ok, maybe not but they hype surrounding the movie killed it for me. It's not a masterpiece but an ok film. Why the one star? Way too many 10's! For once I actually agree with the actual critics who graded this film.", "OverratedThis movie is overrated...... Atract people to be crazy and encouraging them to be massy.", "Overrated and overhypedStory was just really unconvincing. Nobody really cares that much about some random dude who is as ineloquent and uninspired as the joker is. The hype portraying the movie as painful and cruel is just cringe. To see this rated better than \"One flew over cuckoos nest\" that shows way better cruelty saddens me.", "Engineered TrashAs pointed out the story reveals a cynical perspective of a pointless protagonist that does nothing except react to its own environment. This is not a story; it's engineered agony.\n\nThe technical aspects might be good, but it all means nothing if the story's garbage. It's like serving garbage on a golden plate. The plate is beautiful, great craftsmanship, but the garbage is still garbage.\n\nMovies communicate ideas about human life; why did the author think this is a story worth to be told? It preaches madness as a solution for evil. It preaches that self abandonment is the new cool. This sits right there with the new Star Wars that preaches that the hero doesn't need a journey - the hero gets everything on a silver platter, with no effort at all. What a messed up lesson for life.\n\nThis movie has nothing to offer.", "TediousLabored through until the halfway point (over two days) and gave up. That's an hour of my life wasted. What a depressing, preachy pile of nonsense. I watch movies to be entertained and this movie didn't come close.", "As grotesque as a clown's smileMy husband and I went to see this film and found it extremely depressing. Moreover, everything is caricatured. What could be more normal, you might say, given that it was a depicting the life of a comic book clown? Christopher Nolan, the director of the famous Batman trilogy, said before it was produced that this movie would be useless. Simply because when it comes to horror, the less you show, the scarier it is. If you're told that there is a giant monster in the woods and it eats people, you'll laugh and not believe it or you'll imagine the most horrible monster there is; the most horrible according to you! What others show us is never as horrible for us as what we imagine. Here, to make things really awful, we sink into the worst possible melodrama. As if psychopaths had all been mistreated during their childhood, mocked in adolescence, misunderstood in adulthood without ever having anyone to help them effectively! But no, the vast majority of them were born with a missing bolt in their heads. Something was wrong in them from the start. Here, the director wanted to make us cry by portraying roughly the most cartoonish misery. Everything is in bold capital letters, underlined and highlighted to be sure that we fully understood that the main character didn't have an easy life and that our society is so rotten that we should all revolt and suicide out of desperation or kill each other to put an end to it all. \"Why so serious ? \"asked the Ledger Joker. And that's a good question, because I'm worried about the future of this character, especially for the actors who will want to play him. In terms of the actor's performance, that's Joaquim Phoenix pushed to the extreme all over. In all his films I remember, this actor plays social misfits, loners unable to make friends, depressive people or on the verge of a nervous breakdown, misunderstood guys, sons rejected by their fathers, rebels, etc. In short, he only plays tortured souls. He even played a guy who falls in love with his computer because he can't get along with a real girlfriend. So it's normal that he knows how to play a crazy clown. Talent? If you will, considering the fact that he seems unable to play much else. This simplistic and gloomy depiction of society has already claimed victims. There are people who dress up as clowns and ransack everything in the streets and cinemas where the film is shown. It seems that some misfits wanted to believe that, as with the Joker, their misfortune depended on everything and everyone else. Their happiness couldn't certainly be up to themselves. Anyway, don't believe the good things that are said about this movie. And if you feel a bit out of sorts, don't go to see it, you'll make yourself more unhappy for a film that's really not worth it.", "Extremely disturbing and ImmoralAlright so if you were to ask me about the acting, the performance, the cinematography etc, Joker was good in that. However, the story line was completely messed up and disturbing. The film itself and what they teach you throughout is just wrong, I mean plain wrong! It basically encourages you to \"be the bad guy\" because \"bad stuff happened to u\". Summary: Extremely Disturbing and Immoral", "What a jokeSomething is really wrong with society if that movie is so highly ranked.", "AbusiveCharacters that suffer abuse can be a good element in a plot. But audience should never suffer abuse. The audience needs to experience catharsis in the end. And this never happens with 'Joker'. The film has a huge problem, which it never manages to solve: it wants to be realistic and tell the tale of an innocent, abused individual who snaps; but it also wants to exist within a fictional universe in which this man is as much of an abuser as he is a victim. And this creates problems for the screenwriters that they never manage to solve. Thus Joker comes across as a sympathetic character first, but turns to a vicious killer towards the end, at which point everyone becomes confused, and stops liking him. There is no redemption of any kind, no satisfying emotional resolution, only a brutal ending which serves the purposes of the wider franchise and doesn't deliver on its own terms. In the end, the character we were made to empathize with becomes nothing but a caricature in a silly superhero universe. And that is an insult to anyone who invested in the character from the beginning. The audience is cheated. Also, one should note the disturbing anarchist/communist vibe in the film - the idea that it's better to burn down the world than allow their particular understanding of 'injustice' to go on. I may pity Joker and hate the cynical Wayne, but I won't put degenerate, mentally ill clown in charge of an angry mob that wants to burn everything down.", "Disappointing as alwaysJP has one and only acting register : the depressed looser, I don't understand the critics he is as mediocre as always. Save your money and re-watch Heath ledger's joker.", "What the hell did i just watchI don't get why this movie is so popular I had to stop watching after 30 minutes of him laughing and dancing every 5 minutes. I started hoping Batman would show up just so he would punch him in the throat and put him in a wheelchair.", "Better if didn't sawDisturbing. Just got out of the movie. My humor was much better before seeing it. At first feel pity for the guy suffering, but he lacks charm and then well he is just a killer. Heath Ledger was far better.", "Dumbest DC movie yetThis has to be the dumbest DC movie yet. Way to miss the opportunity. First the Joker character is all wrong, this depicts Joker as unintelligent person with no wit. WRONG Joker maybe insane but his wit and intelligence is what makes him the master criminal that keeps batman on his toes. His ability to always find way out of being locked up was not demonstrated at all. The bar was set high with Joker in suicide squad and they didn't come close to the epic legend.", "I must have seen a different movieI read the reviews and rented the movie. I could not believe how bad this movie was. The story was boring. The Joker character was well portrayed but the lack of a story over shadowed The actors performance", "Horrible and depressing!!!!OK, I'll agree that Joaquin Phoenix did a great job acting the part. However, I really don't get how people think this is a masterpiece. it was slow, too long, boring, and depressing. I get they were trying to show how the joker was missed treated, had a horrible life, and he finally cracked, but they could've sped that part up and did more of him acting out. That would've been more entertaining, I wish I could go back in time and unsee this movie. What a waste of time.", "I Don't understand, are all people become stupid ??It is the baddest overrated movie I've ever seen in my life, is the people going to be zombies soon ??", "Derivative and UninspiredThere is doing an homage and then there is borrowing wholesale from other material. This film is little more than a remake of \"Taxi Driver\" with elements (most notably the end) borrowed from \"Network\". In the case of \"Taxi Driver\" there are whole lines of dialogue, characters and scenes that are lifted from it and placed in this movie. Except the execution isn't as polished, the acting not of the same caliber and the story not as original.\n\nWatch \"Taxi Driver\" and \"Network\", this film was made 40 years earlier and was made better.", "My First Review: Hollywood is a jokeI'm 36 now, this is my first review ever. Only because I'm sick of all of this. I don't want to sound like an old, miserable man. But Hollywood is failing on me, time and time again.\n\nJust to name a few: the last Blade Runner, the last Star Wars, Toy Story 4, Avengers Infinity War, Endgame, etcetera, etcetera. All the big ones. Disappointment after disappointment. And then there's Joker. I hoped it was the exception... But, no.\n\nApparently, the only way to get good reviews is by hyping and trolling the media and with that, people's opinions and wallets. It's too easy, too boring, too shallow.\n\nWhere are the storylines? In all of the above there is none to be found. No plot whatsoever. No rememberable scenes or quotes. Empty. Nada!\n\nIt's even the opposite of a plot: all these movies just don't make any sense. These so-called 'plots' are written in meeting rooms. Bad, bad compromises that only check all the boxes for the laws of Hollywood. And people fall for it.\n\nAnd I just wonder if I'm the only one who thinks: 1. Joker is a joke 2. Hollywood is a joke 3. Review systems are a joke\n\nThis makes me realize it's not just in the cinema that people let themselves be fooled. Think about elections.\n\nAnd this review will be trolled as well. Keep thinking for yourselves guys!", "Hype for no reasonI made an imdb account after watching this movie. It was that terrible. Watching Joaquin Phoenix do interperative dance and try really hard to play an effeminate mentally ill person. The change into the Joker never felt earned. The movie itself was predictable and forced. A try hard edgelord masterpiece. Surprised he wasn't wearing a fedora. This movie just doesn't get the joke, because it IS the joke.", "Duh?Masterpiece? Are you Jokering me? Mediocre at best. The only explanation I can come up with to explain the gushing praise of this boring film is the dumbing down of a generation by the education system and PC culture. People seem to think its some kind of brilliant social commentary. I usually like Joaquin Phoenix, but here he plays a bland character who comes across as very dull and of low intelligence. His laugh is grating and very un-Joker like, his dialogue is stilted and uncomfortable. There is no wit, no clever dark comedy, just seriousness and depression. The Joker has always been portayed as crazy and mentally unbalanced, but never dim-witted, until now. I don't know why this character is even called the Joker. Other than having the name Arthur Fleck he seems to be an entirely different character. Its a depressing film, which is not a bad thing in and of itself, but in this case it is. Thankfully I didn't pay any money to see this one. I'm giving it one star to even out the ridiculously high rating its got. Otherwise I'd probably give it a 4", "Hype at its finest.Despite the third best performance of Joaquin Phoenix's career, even he can't keep the film interesting. I never believed the hype this film was getting and I was right. Fanboys dream but as true film goes, it's quite terrible. The difference between fan reviews and critic reviews says it all, and even the critics were being generous.", "Awful just awfulWhy in the hell would they make a movie like that... There are enough problems in the world", "Irresponsible Filmmaking at its FinestThis was irresponsible filmmaking at its finest coming at the worst possible time. Todd Phillips should be ashamed. He had the opportunity to offer a positive message to people that see themselves in Arthur's shoes- people that have been wronged by the system and see no way out- and instead he reassured them that they are monsters and the only way they can \"win\" is if they get back at the society that wronged them in any way they can. He's a cash grabber that used his platform to tell an entertaining Joker story, instead of a deeper resonate message like it could have been. From an outsider's view, one could argue that this scenario is what happens when society fails, but this was not told from an outsider's view. This was told from the terribly empathetic Arthur's view, and so I see no reason why a potential school shooter wouldn't relate to him. This is saying to that person, it's better to be infamous than a nobody. It's a very dangerous message at this current time. For those that argue, it's only art, I argue that the mainstream media is potentially the most powerful force in the entire world. Personally, I feel that with great power comes great responsibility. Media makers have the right to make whatever they want, but they have the responsibility to use the power they've been given for good and this was completely the opposite...Objective review: Beautifully shot and acted, but super boring at times.", "PointlessI judge a movie by how many times I needed to fast forward through it. Joker set a record for me. I spent $6 on Amazon to watch this dull and duller movie. It is painful to see how many people wrote positive reviews. Who are they? What did they see? What did I miss? Yeah, I get the comments on society, etc., but so what?", "LameThis movie was so boring, I kept falling asleep. I felt very awkward several times. My son & I kept looking at each other like should we just get up & leave? I probably should have. I cant believe some of the reviews on here. People have very crappy taste apparently. Just shows you, don't believe the reviews. If a movie speaks tour interest, go see it for yourself. This movie however, I wouldn't recommend. It's a total bore.", "Really Bad MovieThe people who made this movie need to understand a few things. You can have great acting, great visual effects, but the story is King. Always has been. Always will be.\n\nDo they really think people will believe this idiot character will become Batman's nemesis?\n\nI bet the people who made the Batman and Robin movie are glad. Now they are not the worst Batman movie ever made.", "Oh please!!!! Get a life!!!In the words of Ford Fairlane, \"It's like m@sturbating with a cheese grater, slightly amusing, but mostly painful.\n\nThis is one of the worst movies ever. 10/10??? So many who claim this as a master piece? Are you so scared to be seen as an outsider that you also add your vote to this uniquely horrible trash film so other will at least think you are bright and not stupid? I'd rather be seen as stupid and know that I can at least see the difference between a master piece and this crap.\n\nPhoenix acting was mediocre at best. All the incessant laughing? Really?? Was that even necessary? This would have been a great movie if it had an intro and credits. All the BS in between could have been left out. There, done! minutes max.\n\nAt least I did not pay to watch this as I would have been double dumb if that was the case.", "Pretentious, dull.....you betThis movie is everything that's wrong with Hollywood. Indulgent, pretentious, overly long and very very dull. The luvvies, the shallow and the right on brigade will love it. No doubt Oscar winning stuff.....lets get the virtue signalling started now", "Piece of garbageSuch a waste of time and money. Boring as hell..!! If it would be possible I would give it -10!!! Overrated....!!!! I guess all because of paid reviews.", "Defenantly second actor to get an oscar from the joker, a dark masterpieceThis Is without a doubt the best protryal of the joker, the way he slowly gets turned by society and becomes skinnier and crazier,defenanrly one of the if not the best movie of 2019", "blaThe message this film promotes towards society isnt what I had hoped. Cinematography and acting are excellent.", "Unwatchable, uncomfortable, predictable trainwreck of a film.I literally created an imdb account for the first time in order to attempt to warn people off of this terrible film. I have nothing good to say about it at all. It was a poorly crated story awkwardly told. The only saving grace is that Joaquin Phoenix acted an awful character in an awful story. I couldn't wait for the movie to end. I found it to be incredibly obvious and predictable for every \"twist\" in the film. The end credits were the best part when I finally was free. I was on a date or I would have just walked out early on.", "Save your two hours and thank meI've read so many 1 star ratings of people who shares the same mood as I do. They have written so long points about the movie. This movie doesn't worth writing so long about it. Just trash. Rubbish.", "Absolutely horrible and desperate cash grabBad acting, bad CG, and the story is just pathetic. Apparently the ability to laugh, smoke, lose weight and put on make up means great acting. Worst movie of the year, hands down.", "UnoriginalThere are so many movies out there about the mentally ill man that, if he had been given an ounce of respect and kindness, would not have gone on a killing rampage. Shutter island, Donnie Darko, and The Shining are just a few movies that are so much better than this one with the same exact plot but they weren't boring! The only redeeming factor of this movie was Joaquin Phoenix's outstanding performance.", "lose of both time and moneyThis was one of the worse movies I have seen. It was over acted by all actors, the story dragged on and on. I saw this movie for a bargain matinee and thought I was ripped off! The only good part was the comfy chairs and the half priced snacks! Phoenix was so over the top and not in a good way. PHOENIX STOP DANCING!!! Deniro played another version of all the parts he has played in the past few years! 2 stars for the chair and 1 star for the snacks, -1 stars for wasting my day!", "Pile of Convoluted Crap - Make up your own InterpretationI watched the film on HBO last night. I hadn't read any reviews. I had no idea what the film was about.\n\nThe Positive: Joaquin Phoenix is an extraordinarily gifted actor and this piece of garbage screenplay was was a great vehicle to showcase his talent.\n\nThe Negative: Everything else. This movie is about whatever you want it to be about. What is real and what is imagined is up to you, the viewer to determine.\n\nWhat a cop out.\n\nI can envision intellectual snobs sipping their brandy and pontificating on the deeper meaning and symbolism of the film.\n\nThere is none.", "BoringWell acted but entirely missed what the joker is. I was bored and found it lacking in anything of value. I have worked in mental health for many years and found this to be a poor choice of paths to take someone down. I found little empathy and even less point to this film. Joaquin Phoenix was brilliantly my score in no way reflects his acting he was simply awesome. If you liked Heath Ledger's portrayal then you will probably also enjoy this movie. This by itself and aside from the DC universe was a pretty good movie as a joker movie it was boring. I almost never give 1 star reviews but this one I could have not watched and been much happier.", "What a crap!!It makes me really feel upset when high score on such bad movie and I regret wasting 2 hours watching it.", "These 10/10 reviews are fakeThis movie is totally garbage. I kept falling asleep on it. It was so boring that I played solitaire, completed paid surveys, and did some online shopping while it was playing.", "Don't waste your timeComplete garbage. Nothing but an artsy Oscar grab and boring. Takes the whole mystique of the joker and turns him into a whiny wimp with mommy issues. I wish i could give it negative stars. I would rather eat my weight in refried beans and ride a roller coaster than watch this waste of film again.", "Very DisappointingFilm was directed and produced poorly. Opportunity to take advantage of the incredible Joaquin Phoenix was blown.\n\nGratuitous violence. Misplaced violence. Wrong approach to joker.\n\nDisappointing connection to viewer. Film was wandering for long periods. Tons of footage that should have hit the cutting room floor.\n\nI really wanted an stirringly creepy connection with Joaquin as Joker. It wasn't there.\n\nIf you are looking for Joaquin moment like in Gladiator, you will be very disappointed.", "Waste of timeFelt like a 2 hour trailer waiting for the joker while a bozo smoked cigs and walked around doing fk all. Finally the last 5 minutes came and i thought wow we have a movie then it ended. Id rather spend my 20 on some face paint and some pints and actually enjoy my life. This will go down as one of the days where the long awaited hype was flushed down the toilet. Thank you for that.", "No doubt Joaquin Phoenix is amazing but movie is waste of time.Joaquin Phoenix performance is absolutely amazing. I could have done million better things with the time that i wasted watching this movie. Utter waste of time. decided to watch after all the hype on social media. But movie deserves 0 stars.", "Mega boreI use IMBD ratings to decide which films to go to see at the cinema. When I saw that this film had a 9 rating I assumed that I was going to see an extremely good film. How wrong I was, the film was less than average. The film didn't get me emotionally involved in any way. I didn't feel sorry for the main character or any of the other characters that he murdered and none of the other characters in the film moved me in any way. It was a \"run of the mill\" film that I couldn't wait to end. The only good thing about it was that my 15 year old granddaughter enjoyed it.", "Pseudo art for theatrical wannabesThat is one of the most aimless, predictable and shallow films I've seen. The only thing that made any sense was that it was somehow connected to the Batman universe. Joaquin's ability to portray a psychopath, although pointless, was ultimately decimated by the fact this was a Batman film. I can't really take it seriously because of that. There is no real social drama, it has no message and is full of fallacies. It doesn't raise any awareness. Dialogs when present were pathetic. All in all the Joker is neither a real film based on true events nor a fiction. It tries really hard to do both and it fails spectacularly.", "CrapThis movie rips off other movies, doesn't have any redeeming value, and even implies Bruce Wayne is the father of the Joker? What kind of joke is this? Not a DC movie, not an origins story. Just the work of some hack who stole ideas from Scorsese, and tries to make a dangerous, ill man into some kind of folk hero. Unfortunately Joaquim Phoenix just overacts in this one. And he's in literally every single scene in this movie, so it becomes very tiresome to watch. Crap.", "A MASTERPIECEJoaquin Phoenix's performance is different. He is over acting some times. Phoenix is not being true to the character. He is what he is because what he experienced. The childhood trauma and the time he spend in the asylum. If He is out in the society because he is fit to do so. The seven medication doesn't seem to have a bit of effect on him.\n\nAfter the metro incident he is breaking a chain to free himself from what the society need him to be. There is no change in his ways. The character didn't evolve. He is same at the beginning and at the end.\n\nSeventy percent of the film's screen time is dedicated to Arthur Fleck. All the other characters are ill written, only to support him. They all lack a soul. Even Robert deniero disappoints us. He lost his aura somewhere in the nineties. The film is spoon feeding us. The viewers are not idiots we know what realism is. The scene where he realizes the character Sophie is his figment of imagination is an utter failure. Apology to Andrei tarskovski. And the scene he is showing fatherly affection towards Murray is like a worst of the worst psycho moment. After the incident of metro killings, the plot loses its grip. I clearly couldn't define what happening and why. The script hides in the smoke of violence. That is too disturbing to watch. And I forget to mention the letter. A Pathetic turn of the film. The film 'saw' is better than this. I hate the communist tone used in the film. By showing us a glimpse of modern times, Todd Phillips making a point. The joker is saying he is not political. It is kind of a doublespeak. In fact the film is a doublespeak. Creating chaos without the intention of creating one. The poor class killing the rich for the societies inequality.\n\nWhat I loved in the Christopher Nolan's joker is his philosophy. He is an agent of chaos. He like to watch the world burn. While the Batman is an agent of order. He may be a clown but he is deep inside. The Nolan's joker can make an elaborate plan and execute it efficiently. But Philp's joker is mere a delusional shallow clown. I ask myself, Why the movie is called 'Joker'. Remove the names of Wayne family and give them another names. Replace Gotham by Manhattan. The result will not be a DC joker instead it will give us a psycho clown movie. Todd Philips used an icon for his own gain.\n\nA predictable ending. Giving the society a false message.for what? The film is not worth it. Yes, it is a masterpiece. Whisper it a trillion times, may be it will became one.", "Is that a joke?Still heath ledger best joker ever this movie sucks", "Bored the hell out of me!A long drawn out film. Nothing in comparison to the Penguin character's evolution in Gotham.", "Dark and boring movie. No value. Better watch plants grow! This movie is NOT recommended.I was tricked by the hype and people calling this masterpiece and best movie of the year. Well... it is NOT!\n\nMisleading name of the movie would indicate this is prequel of Batman and there is a bit - Bruce Wayne parents were killed.... but not by Joker as you may think. The rest is psychological drama.\n\nPlot is nothing special. Far from spectacular.\n\nActing is shallow. Disappointing and plastic (hysterical laughing). Too much killing. Should be R rated movie.\n\nEnvironment (the venue) is terrible. Was the idea to show all around falling apart, dirty streets, rotten apartments, rubbish everywhere? Then riots and trashing shops, taking TVs and VCRs... was this already in Robocop and Police Academy? We did not move on from 80s?\n\nAnd people crazy, violent, bullying... What a poor way to portray society! There is not a bit of happiness. Is this kind of stage we appreciate and call the movie \"masterpiece\"?\n\nTime and money is gone. Can't un-watch this. Can't delete it! And should give a thought earlier by seeing whole lot of 10/10 reviews that something is not right.\n\nNot recommend for watching. There are plenty of movies out there (and I exclude \"Avengers\" from the selection).", "A Banal and Pointless ExerciseIf Todd Phillips wanted to spend $55 million on creating yet another pointlessly glorified, anti-hero and attempt to pass it off as a case study of a mentally ill agent being displaced by society, he could've at least spent a portion of that budget employing people who are able to contribute honest, fair, and much-needed portrayals of actual disaffected minorities in society.", "If I could give -1star....Disturbing with very little entertainment value at all. I'm sitting in the theater feeling extremely uncomfortable and my mind is wandering to all of the young, white, disturbed men that have senselessly murdered people in our country. I don't feel this film would illicit the same behavior with stable individuals but we cannot know what impact it would have on emotionally disturbed people. Parents please be aware of the content before endorsing this film for teens.", "AwfulI really don't understand how so many people consider it a masterpiece. I simply hated this movie since the very first minute. Maybe i have no sensibility at all to feel any empathy with this joker. The character is annoying, the screenplay is annoying, the music is more noise than music. One of the worst movies i have seen in the last years. And i don't save neither phoenix. I never liked him, but the way he laughs is absolutely awful. And laugh for the joker is so important... take a watch to Gotham and you will see the best joker, even better than jack nicholson and heath ledger, miles away from this rubbish", "What the hellI HATE THIS MOVIE!!!! It is complete crap. I really don't understand the hype over it. I was watching it and just couldn't watch it till the end.. it was so boring. I made myself go and watch it again till the end, but again there was no way for me to do that. It was extremely boring, made no sense, zero connection to Joker. When I saw people writing that Joaquin is better joker than Heath Ledger I just needed to see that. But now I'm asking myself are these people freaking normal, you just can't put these two names in the same sentence. Joaquin's joker can't and never will be better because it even isn't a joker, it is a disaster.", "Stupidly boringThis movie is a boring movie who didn't do anything to us, not emotional without anything important and joker in this movie is acting very stupid gay who dances like a creep. Endgame is better in every subject about ratings, awards and box office, the only problem is the way to let people to mark movies by their own stupid reasons and it's just three points better than endgame and it's getting lower.", "SlowThis movie was so slow... it felt like I had lost about 10 years of my life. The performances were good but it took so long to get to the interested parts. This movie was also super depressing. I could not get into it and didn't feel any empathy for the Joker. I was hoping that this would be better than wonder woman but it was worse", "overrated for daysJoker (2019) = overated\n\nJust another cash grab *sigh*", "Just badThis movie is utterly unimaginative, full of cliches, boring and predictable. Plenty of ridiculous plot twists and chaotic, inconsistent and incomplete ideas. It also trivializes and destroys the Joker character built by previous films where he has a clear ideology and actually stands for something. Waste of time.", "Wonder how it's a good movie??I wonder about the people who says\"it's a good movie\"?? (Not about performance). I guess some kind of advertising agency may played role to make this movie hit and few people who thinks themselves they are more intellectual (really may not) follow it. I never seen such a bad movie having no entertainment, no moral.. Moreover, I feel it's conveying dangerous message (cruel,kindless as hero) which may misleading immatured people(should be 18+)", "What a wasteI Have rarely been as disappointed in a movie as i have been with this one. I went in expecting a deep interesting and entertaining movie. What i got was an awkward incredibly boring film. All that hype for something that is 60% the joker being awkward. I kept waiting for it to pick up and become interesting. I was expecting something on the level with Heath Ledgers joker but it failed to gain my interest in the least. Like many critically acclaimed films this movie was a complete joke to me.", "Boring like hellNot sure why so much hype about an ever so boring movie. Over implying the obvious is what is going on in this nonsense called Joker. Moves at a snails pace and ultimately one loses all empathy towards the main character. The whole boring drama tries to drive in the fact that the Joker is lunatic and it just never moves on. Joaquin is wasted in this over dramatic saga. Each to their own, some people love it coz they cud probably relate to it, but I hated it.", "Worst movie everJust went and watched the joker movie and it has to be the worst movie I have ever seen 1 out of 5 stars", "Waste of money and timeThis movie won't be felt only by those who suffer and feel such feelings as the character does... It need some ill people mentally or physically who suffered during there life time to appreciate it. And from the rating I believe that a lot of ppl have experienced such circumstances hence the sympathy towards it.", "Over Rated...dont waste your 2hrsBored during movie, very slow Dark knight was far better than this Acting is very good Direction is very poor", "Badly overhyped and poorly executed by allThis was badly overhyped on all levels. Joaquin Phoenix whom I usually enjoy did not portray the man who became the Joker very well. Robert De Niro whom I normally love as well was just a twisted version of the late Johnny Carson. Worst of all was the directing job of Todd Phillips. He should not have taken on this movie. DO NOT WASTE YOUR TIME", "Dark Gloomy Disturbing Horrible should be R ratedHated was looking forward to it. Its not for anyone to watch. Promotes hate violence suicide and Murder. Please pick another movie to go to. Not sure what movie the other people were watching.", "Overrated and overhyped movieThe only good thing about this \"film\" was Joaquin's acting. Everything else is garbage.", "Don't believe the 10 * reviews.The movie was truly awful. Had a difficult time staying interested in it or awake. There are hundreds of reviews under 4 stars and I have to agree with all of them so I'll not rehash them here. I found nothing likable about this entire movie other than the Joker's costume at the end. That was stylish. :) His green hair color was a fail. You can't just dye dark hair green, you have to bleach it first to give it some pop.\n\nAll the 10 star reviews seem to be a clone of each other, copy pasted using the same generic superlatives to praise the film. Words most of the 10 star people probably don't actually understand the definition of.\n\nThis film had no place in the super hero genre which you usually would take your children to go see. If you took your kid to THIS movie, simply put, you are a horrible parent.", "AwfulAbsolutely awful script, oscar nominations you got to be joking unless they give Oscars for the most boring film made. It was on par for the worst portrayal of the joker with Jared Leto.", "DisappointingThere was nothing mentally or emotionally intriguing about this film. Outside of the amazing lead acting, this movie's only suprise was that a known antagonist was the main character. The script was lackadaisical. The events were over dramatized and intangible. As a person who's suffered from mental illness myself, this movie did not portray a mentally ill person. It exponentially exaggerated what goes on with in the mind of the victim. Those who enjoy this portrayal are likely the non victims. As for how the comic book character was written: this story did adapt the idea that the joker knows he's a villain and enjoys it. At the end Arthur is still just a guy going to extremes to be accepted by society, instead being the joker who reshapes/exposes society to be something he thrives in.", "BORING AND OVERRATEDHow is this boring \"movie\" get so many 10 is beyond me", "Worst movie I have ever seenI feel like the only person who thought this movie was absolutely terrible and a complete waste of time and money.\n\nFirstly it's in no way entertaining. Every scene is an endless indulgence of people trying to be artsy but only accomplishing a boring, frustrating and pointless video of an actor being totally mental. Being completely mental is not hard to script or act, nothing needs to make sense and you don't need any element of normality - enter the joker. Acting on the spectrum is much more difficult - think Forrest Gump, I am Sam or Rain Man.\n\nSo if it's not meant to be entertaining than what's the point? Just to make you uncomfortable and frustrated? Job done. But who wants to watch that? No thanks.\n\nAs far as being the joker that's the most disappointing aspect of the film. The character has 0 intelligence, manipulative inclinations or ability to scheme and organise (again he's completely insane). He's also not funny. The joker from the comics is the antithesis of batman. He has no back story, he's clever and cunning and always putting things together. He runs a criminal empire and never acts alone. This joker was a loner, totally insane and gets in a fridge? Also he's far too old to be the joker, when Bruce grows up he'll be fighting an old man. So if it's not a joker origin story then what is it? A poorly scripted, weak story with an agenda to showcase an unrealistic perspective on mental illness.\n\nThe story moves along at a snail's pace to make allowances for the joker to dance around looking like a fruit cake. The whole movie is uncomfortable and low resolution in its plot and motive. If this is what passes as a good movie then it's a very sad day for humanity 1/10", "Just Plain GarbageEverybody must have watched this movie with blinders on .it is not Oscar worthy ,boring as hell no dialogue or story to speak of .you cannot compare him to Heath Ledger or Jack Nicholson .His laugh is horrible.People are gullible spending money to see trash like the blairwitch project .I rated 1 star only cause couldn't do 0", "Insanely overrated and overhyped.It's just a bad movie. It is slow, boring and disturbing.", "Did you really watch it?I am seriously curious, do all ppl who are rating him so good watch it? Did we watch that same crap! You are totally overtaken by the hype. No good direction, soundtracks, cinematography, decoration, costumes, plot, everything is Just out of context, all the sequences are irrational and not linked to each other.. I am totally disappointed. I waited long time and hoped alot from this movie! Total crap!", "BoredI really don't understand how this has such high ratings. I really tried to like it but fell asleep less than halfway through.", "Can't fathom the love for this movieDon't get the love people have for this movie. It starts as predictable slapstick comedy, then takes a sudden turn into a bloodsport parable on class warfare, and then then finishes -- can you guess? -- Nihilistic irony! Oh, that is really original, isn't it? All of the characters are unlikable, one-dimensional, amoral, lemmings. Apparently, Korean free enterprise economy makes them this way and their personal aspirations, ambitions, and accomplishments are simply results of circumstance and luck, as the wealthy and the poor are equally dimwitted, amoral, and self-interested.", "What a pathetic drama.Maybe people get too emotional in West. May be that is why it got an Oscar. There's nothing special about this movie; the story so average.", "The reviews are misleadingLudicrous movie. I can't understand the reviews. This movie is full of insane people acting completely illogical. The poor are lazy and threacharous, while the rich are naive and simple. Don't believe the hype.", "Below average movieWhoever calls it a masterpiece just don't know meaning of masterpiece at all. I don't understand how this movie got oscar. It's just very normal average movie. Too much hype for this average movie.", "Did we all watch the same movie?So the movie won an oscar, was claimed to be a masterpiece and so on. Like most Oscar movies they are either really good or really bad. In this case the movie was highly overrated.\n\nIgnoring the fact nothing that is done in the movie is logical or would actually work in real life, the movie doesn't seem to know what kind of movie it is. If movies have a twist or something you didn't expect, usually you are like \"Oh wow, that was amazing!\". But this left me confused. Alot of what happens makes the movie feel pointless. Obviously this is a spoiler free review, so I'll just say some movies have good guys and bad guys, not sure if the movie makers understood what that means in this.\n\nThe only reason I gave it two stars was it was South Koreas first movie to get an Oscar.", "OverratedWhy this won best picture I will never know. The translation was horrible. Plot filled with holes, and so so acting.", "Honest review. OverratedIt's overrated, it doesn't deserve to be in 250 at all, nor does it deserve to be higher rated than 6. There is no point, the first few minutes are funny, then predictable. You will be waiting for something to happen to justify that above 8 rating and show why it's on 250, but nothing happens. It is entertaining a bit", "A Textbook Film Of PretentiousnessThe opposite of a singer who sings with soul is a singer who sings *as if* they have soul. This movie was done *as if* it were a satire, *as if* it were making a statement, *as if* it has a deeper meaning. Instead, it's hollow at its core, mean-spirited, and pointless. It's a film for those like the idea of making a point but not having to suffer any uncomfortable truths.\n\nThe only good effect of this film is that it exposes the vacuity of those who praise it and their self-delusion. It's a barometer of the public's appetite for garbage. See this film only in the context of a sociology experiment and be shocked at how far we've fallen in our gullibility and how desperate we are not to face ourselves.", "Shocked by the great reviews : Are they fake?The film started off well and an interesting concept started developing However , it suddenly turned into mayhem and utter stupidity . It was nonsensical .\n\nYes, I got the message about the rich and poor divide etc etc but that's nothing new and just reality . I was disappointed in this movie as I'd read great reviews. It was an utter waste of time !", "It's a scamOne of the most overrated movies i've ever seen. The hype was for nothing and everything was predictable.", "Just terribleI so wanted to love this given the reviews I have heard but I was left wondering what film other people had seen. Idea was good but it was a nothing story in the end. So disappointed. Found the subtitles too small. Just could not have cared less. Why all the hype?", "Absolute mediocreA mediocre movie. Did not get at all what all fuss is about.", "Another attempt at pretentious social commentaryParasite (2019) is widely renowned by many members from the film community. At first glance, it appears that they are genuinely praising the movie's artistic quality but the truth is, they are merely praising its supposed profound social commentary and propaganda.\n\nIn a society where people prefer to stay in echo-chambers and repulsing those who don't fit the status quo, it is no surprise that this motion picture is highly acclaimed given that it appeals to the ideologies of Marxist lunatics today by making the audience feel sympathy for the poor characters and contempt for the wealthy ones.\n\nThe movie doesn't necessarily condone the main characters' actions as it still portrays their crimes in a negative light. But that leads us to another issue; the movie wants us to think that their crimes are the results of \"genius\" planning even though their plans are only made possible because of some stupid plot point that requires us to suspend our disbelief. It just goes to show how much the film is trying to insult the audience's intelligence by thinking they'd buy into it.\n\nIn summary, the director Bong Joon-Ho seems to believe that class and status indicate one's character, as evident by his attempt at portraying the main characters in a positive light despite them being a bunch of lazy and conniving criminals. Perhaps, the only redeemable quality of this film is its cinematography which admittedly is quite beautiful.", "Too UnpleasantThe plot is very good, with loads of twists and turns. However, I did not like this movie. It was an entirely unpleasant experience.", "Very disappointing movieThe movie won an Oscar, so I went to watch it with interest. But I was very disappointed! The actor's performance is good, but many of the plots of the movie are too rigid to make people seem stupid. Many people say metaphors, but I think that's a stereotype of class. The film portrays the poor as unscrupulous, and the rich are stupid. The director may express something worth thinking about, but the carrier of expression, that is, the plot of the film is stiff and failed. I'm puzzled that this film won an Oscar.", "Took about 11 tries to finish it.People kept recommending it so finally I pushed through to the end and what a drag it was. It seriously too about 11 tries to finish it. Slow, boring, unlikeable characters, disqusting. It had good photo so 2 stars.\n\nTrain to Busan is a different genre (or rather it has a genre) and is a much better Korean movie. This was just boring.", "One of the worst movies of the year, the real horror is that it got so many good reviewsThis movie is horrible on so many levels, its remarkable: The story/script feels like something a committee of teenage boys constructed during one drunken night, and the execution is mediocre at best (thanks to few OK actors) but overall painfully cheesy. But the true horror is, that this movie received so many awards and highly positive reviews. It makes me question the sanity and taste of humanity in 2019. If that outcome was the intention of the director, then he is a true meta-genius. In summary, skip this movie under all circumstances - its a true waste of your precious life time.", "How has this got such high scores and reviews?I don't understand how this did so well as the movie is really substandard compared to other movies that come from this region. The way it's scored across all sites I thought it was going to be as good if not better than Oldboy. The reviews kept saying stick with it and there's a mad twist at the end. So I stuck with it even though it bored me half way through and the twist at the end was so underwhelming I was a little bit angry and wasted my time. This scored a strong \"Meh\" with me. Dont waste your time", "OverratedIf you watch this movie you will probably like it or love it. Why? Because you are supposed to love it.\n\nIt's not a great movie. It's not even a good movie.\n\nIt is completely implausible, slow moving and has very little story.\n\nBut you will like it. Everyone already told you to like it.", "Very disappointedThe film won the Oscar for the first time in the history of Korean films. I wondered where it was better than other Korean movies, so I went to see it. To be honest, I'm disappointed. The film is too stereotypical and many plots are stiff. There's a lot better than this movie, and I can' t understand it won the Oscar.", "It won best film oscar.....How? How did it do that? Oh yeah because the oscars have been rigged for years that's how.\n\nBad acting and a bad script with too many plot holes and chunks of total boredom.\n\nIf you liked it then good for you. If you're pretending to like it just to seem like you \"get it\" then you are only lying to yourself.", "Poor acting//overated filmThis film has interesting scenes & cinematic direction but the suspense fell flat for me. Going into this film I thought it would be amazing because of all the reviews but I couldn't cling to the concepts. This movie is in no way a masterpiece.", "Everyone is awfulThe idea that the Kim family are underdogs simply because they're poor is what makes this movie unenjoyable. I like dark comedies as much as the next guy, and I like watching well-deserving people get their just desserts. But every single character in this film, minus the Park kids, are just so awful - to each other, to others, to themselves - that I never felt any sympathy to the Kims and instead just sighed my way through the movie thinking, \"oh my god, of course this is where this is going because what else could possibly happen.\"", "What's the hype?I don't understand the hype surrounding this movie. First, similar subjects have been covered many times before, e.g. \"Shattered glass\", \"Catch me if you can\", \"Bling ring\". Second, this film isn't particularly educational or anywhere near a real event. Third, this film doesn't even stand out among Korean films, the acting, cinematography, scripts are good but not great. I'm sure most people would have no recollection of this film in a few years because it's a movie about ... nothing.", "Dont Beleive The HypeThe first half of the movie is very good and then the movies takes a Cohe Brothersesque turn to the absurd. As with the Cohns Adaptation and some others (and I'm a major fan of the CB), when the writers ran into the brick wall not knowing where the story should go, they turned to the absurd and contrived the rest to the intelligent consumers utter disappointment. This movie will not last the test of time and its user rating will fade lower in time. Worth the watch just to learn how to finish a screenplay thats amazing but has yet for formulate a working ending... Just contrive the absurd and youll win an academy award.", "This movie took years off my lifeI have no idea how this got any good reviews. It was confusing and boring. Not for me.", "What a wasteA waste of time, of energy and of the stuff that award trinkets are made of. Why this shallow so-called satire has received accolades around the globe is far beyond me, but there you go: it's the emperor's clothes all over.", "I dont understand why...Ok .. everyine give high rating but i said this is a bad movie.. the acting is good.. but the movie is not..", "This is Decidedly NOT a Best PictureBest foreign film -- I can't say. But best picture overall? No way. It's excruciatingly slow and the story has been done before. It's not particularly funny either (like that other Korean film from a year ago was).\n\nI never connected with any of the characters or cared one bit about anyone.\n\nJust another example of identity politics and Hollywood giving undeserved awards.\n\nHow did Joker get overlooked?", "It's not as good as the ratings make it out to beIt has good start which quickly wraps you in and you get curious all along but once they're set in the plot, the movie dies down quickly until the 'last event'. The last event wasn't too disastrous except Mr. Kim's action. The naivety was tremendous from the housewife and tries too hard to sell. For the acting, it was top notch from everyone involved. The film is decent but don't go in with too much expectations as it's now nominated for oscars as well.", "It's not what i expected it to be.By it, i mean Oscar worthy.\n\nLike some of the rest here, i did not get it. With so much discussed about metaphors and the likes, I am either not good enough to read it or too casual not to over-read/read into somethings that's not there in the first place.\n\nThe movie tries too hard to be clever and it unfortunately ends up alienating people like me who come in hoping it may draw you in like the Shawshank redemption does.\n\nMy humble view notwithstanding, my congratulations to the Director for his Oscar win. It's a fabulous nod to Asian Cinema. It doesn't hurt that a ton of people here enjoy it too. That's the beauty of films, some like it some don't.", "Poor is the new great (it seems)I watched Parasite with an open mind. I deliberately avoided reviews (far too many fake ones out there) and even the trailer. After sitting through it, a film that in all honesty made two hours seem like three, then coming onto IMDB to see what others thought, I'm astonished. Let's begin with the positives though - cinematography was good, acting was okay(ish)... and that's about where it ends. The negatives are considerable though: A weak script which often made little sense or logic, more plot holes than Swiss cheese, ridiculous scenarios that defied belief and an ending that completely falls off a cliff edge and leaves the viewer wondering why they wasted two hours on this drivel. In reality I'd probably rate it a 4/10, but as at time of writing Parasite sits at 8.5/10, which is farcical given how weak this film is, I'm giving it a 2 to try and restore a bit of balance and common sense. I am gobsmacked at how many on here are rating this a 10 and can only presume that it's down to a complete lack of quality movie experience or, more likely, that some are so oversaturated in the endless stream of CGI comic book garbage we've all been subjected to over the last decade+ that anything, ANYTHING that strays from the rut immediately garners a flailing of arms and lauding of \"Best film EVER!!!\" Thirty years ago this film would've been where it deserved towards the low end of the barrel, but in today's distinctly subpar cinema offerings it's now being tipped as on Oscar possibilty. Utterly ridiculous. For those of you who are praising this film as the best thing since sliced bread, go and get yourselves a film education. A good place to start is Claude Berri's marvelous 'Jean de Florette' and 'Manon des Sources' to see how it should be done. Films you actually don't want to end, rather than praying for them to finish one hour in.", "A major disappointment of a movie2/10 for this, this movie was extremely slow not engaging and tediously boring, if you want to catchup on some sleep this will work? This movie is one to watch. It seems the Oscar win for best picture was a diversity quota gift. I wouldn't bother with this movie\n\nI saw 1917 when comparing it to this it was the deserving winner, but Hollywood is full of politics. This is the reason why ordinary people are losing interest in Hollywood and turning to streaming platforms in droves.", "Huh?At a loss to figure out why this film 1) won best picture of the year US Oscars 2) Cannes Palme d'Or. Also at a loss to understand why film categorized as a comedy.\n\nThere are moments of humor, but they are few and far between. The violence is also unwelcome.\n\nOn the Oscars award: \"Joker\" is a much stronger candidate. At least the audience has been advised of the violence in advance.\n\nSave yourself time, and possibly money. Skip it", "Not a Fun Watch, Not Interesting, Not QualityParasite is a shockingly overrated film that provides no likeable characters for the audience to root for. If anything, the most likeable people are the wealthy family being taken advantage of. This can be forgiven, movies with bad people as leads can still be good but Parasite is a depressing and often ridiculous ride. There are completely unrealistic twists and turns and the final bloody actions of the main character seem unwarranted and mildly out of character. I left the theater feeling like I had not only wasted time but was put in a bad mood from the overly bleak nature of the film. I know I am in the vast minority here, as every other person I have talked to loved the movie, but to me Parasite was not just unworthy of a Best Picture award but was an terrible movie.", "Well filmed but trivial storyFirstly, two warnings: 1. No real spoilers below. 2. My wife and I did not like this film at all (but note we also hated Pulp Fiction and Little Miss Sunshine which were also very popular with many people).\n\nThe cinematography was excellent. Beautifully filmed and showing bits of Sth Korean life that I had never seen. Of course, some aspects, the unemployed family and the wealthy family themselves were probably atypical.\n\nWe both thought the story and most scenes were quite \"old style\": trite, contrived and quite trivial. The film didn't venture into slapstick thank goodness but the lines and jokes were simple old ones transposed into a modern setting. I chuckled slightly ONCE during the film. Just not my sort of humour (give me \"Kives Out\"). In terms of drama it was a bit like watching grass grow, OK interesting grass but that was all.\n\nThe ending had a strong message but was executed in a completely over the top and ridiculous manner, and out of all context (style-wise) with what preceded.\n\nI can understand why a lot of people loved this film, and laughed a lot (although noone else was laughing in the cinema when we viewed the film). It has some strong elements in it but just dragged out too thinly for me.\n\nWorth seeing this film just in case it is your thing.", "Not as good as people saidAfter the first half this movie went completely down hills. Over and over I kept thinking \"was this scene necessary, What's the point?\" right up till the end. Don't wait for a huge plot twist at the end either, this is not freakin' Sixth sense! And, I dig gory, and thrillers, but this movie is just a no for me.", "No thanksDecent acting, not great. Not suspenseful. Not thrilling. Not scary, not even a bit. Decent overall message. Parts seemed overly forced. Too predictable. Only finished watching hoping it would improve, but it did not. Would have enjoyed it more had it been 35 minutes long. 2 stars for effort and production. The high ratings are suspicious and puzzling.", "Kari On KoreaHow in God's name this got an Oscar is beyond me. Starts very well as a concept and even holds ones attention for the first hour. After that it becomes simply daft and corny. In fact it becomes pure Kari On. Definitely a big mistake to throw Oscars at it, I'd throw Soy Sauce. Give it a miss.", "Really?It's a travesty that this won Best Picture over \"Once Upon a Time...in Hollywood.\" Very predictable. I kept waiting for it to turn into a great movie. It didn't.", "Terrible excuse for the best picture oscar!Saw this movie today. While well acted and photographed, the story was nothing exceptional. Interesting for a while, yet waiting for something better to happen which never occurred. The last third of the movie turned dark and disturbing not only for the violence but the silly way it ended leaving me shocked at how it won the best picture Oscar. The first thought I had as the final shot ended the movie was: \"Are you kidding me?\" The all time worst choice for best picture ever!!!", "DisgustingI didn't enjoy a single minute of this movie. OK, the plot was interesting, the actors were good, but when ALL of the characters are unpleasant and most of them are a bunch of lazy, nasty parasites I can't have any positive feelings. And it is not about being poor. The characters in Slumdog millionaire were in worse situation, but there was so much more humanity there... Here, I saw an example of a mental cesspool.\n\n1917 was my choice.", "Run fast from this movie!Every single minute of this movie I was wondering why, why, why, would anyone give any credit to such rubbish. How a terrible movie like this would get any praise at all! And I finally got the answer: Political Bleeping Correctness. \"Give an award to the different people even if the movie stinks\"! A criminal con family. Are those the new \"heroes\"? The Shawn of the dead is much better than this. Run fast!", "Not worth watchingA overrated movie,plane and simple. They should decide are the oscars about politics or about movies.", "An overrated movieIt does not deserve all the Oscars it has got and its just an averagely done movie. More deserving movies have been left out of oscars just to oppose the government. Such a shame.", "OverratedUnderlining that every taste is different. I just have to say that my experience was too boring, there were even non-sense moments. Like every bad movie.", "trashI do not like the Korean films, I do not think that they are as transcendental or innovative, much less films that remain in the memory of the viewer as the American ones of the past and I think that people only see them because of the crisis that Hollywood is going through. Sorry my bad english.", "Clueless where the high ratings come fromFirst half was ok- acceptable. Second half full of farfetched storylines and violence.", "DisappointmentI usually don't put in negative reviews but omg this was sooooo bad. 😑😑 bored out of my mind", "Terribly overratedThis movie lacks depth, nuance, and completely misses the mark when it comes to emotionally impacting its audience. I'm baffled how this film has won so many awards as it doesn't draw one in to really care about what is being shown. It's silly, shallow, and makes for an okay horror flick but if you're looking to learn something, be moved or gain new perspective I suggest just reading the newspaper instead.", "I tried to like. I really did.This movie was well written, well acted, and the theme (the have's & have not's, & what they do for personal gain and how to keep it) was, indeed, vividly executed. I'm just regretful that it spent so much time on the dark sides of human nature. It's my own fault for sticking with it to the bitter end, but can you blame me? It's a pandemic, for crissake! I've already watched all the movies that actually make me feel good about the human race. This just isn't one of those.", "I needed to read the 1 stars this time.I couldn't wait to watch this film after reading several 10 ratings reviews before, but after watching it today I've been compelled to agree with almost everything the 1 stars are saying here today.\n\nThe film did not live up to being a great Korean film, or best anything, and especially not Oscar worthy, where the only thing I enjoyed about this film was that view from their living room because the plot was an insult on a few levels.\n\nAnd I'm not sure if anyone else had the same issues I had with the subtitles being extremely small to the point I was squinting trying to read the lines while watching it on Amazon Fire tv. That was a first for me, nevertheless, I understood enough to know that this movie was highly overrated!\n\nWhat a huge let down, I think I want my 4.99 back.", "I dont understand how this movie got 8/10This is a real bad movie. Nothing makes sense. There is no strong story or something to focus on. Its a waste of time !", "What a freak showIf you like this movie, you have a sick taste. Literally. You light laugh and be surprised during the movie, sure, but the \"message\" in this movie is given to you in the first three minutes. Poor people are evil leaches trying to lure the rich. What a fantastic message. And this film was given four Oscars? Laughable.", "Started okay, turned ugly and dumbSo the super smart members of a poor family (why don't they get real jobs?) take advantage of the gullibility and kindness of a successful rich family to take jobs in the rich family's home (getting other people fired to do it) and then abuse that kindness...with a totally stupid ending...and this is supposed to be a statement against capitalism? How this trash won the Oscar when there were so many good nominations that year is a mystery.", "plotting, scamming, farceThis is a black comedy with peculiarly oriental sense of humour. It involves plotting, scamming, farce, and a series of increasingly bizarre events that eventually spin out of all control, with a macabre twist.\n\nIf you laugh at people having accidents or enjoy the Japanese game shows where contestants have to eat large maggots or suffer cockroaches crawling all over their faces, then you'll probably enjoy the humour.\n\nIf you're not on that particular wavelength then you might struggle with some of it. The film won the Palme d'Or at Cannes, but as with Barton Fink - another winner - the award seems increasingly to be a measure of novelty.", "Don't like it at allII don't like the characters. It doesn't move me. It's cold but not cold in a good way. I don't know what the message is. Just becuase it's an unfair class society you can act like an ***hole? The ending is silly. The characters revolting. It's an empty film an dthe rave reviwes are foolish.", "Kinda boaringI don't like the movie It is kinda boating u will really not enjoy watching this", "PARASITE - 2/10As a huge fan of Snowpiercer, I had incredibly high hopes for this film. Hopes that were far too high, and far too unrealistic. What the hell is this story. And what's the point?\n\nParasite feels new, fresh, original.. all of the things that likely earned enough attention for so many so much acclaim. But where is it all going?\n\nIt's kind of an anti-hero tale. This family is pulling off a multi-layered, clever con on this gullible, innocent family. And as the main characters, you're kind of rooting for them. Or, at least interested and invested in their story and where it's going.\n\nThe concept is not my favorite, but it holds water as far as a plot goes. However just as you are wrapping up at 2:00, and wondering where this plane is going to land, the film takes a wild unexpected turn for the worst. And now you're wondering what kind of film you're watching. Is this thriller? Is this horror? Is this drama? Is this mystery? The plot twists along the way are catchy in their own right, but lacking heart, these genres don't quite all come together.\n\nThe fact that this film won Best Picture at the 2019 Oscars is baffling... beyond me.\n\nWhat little message there is to this film leaves you hopeless, questioning purpose and the future. Not the kind experience I'm hoping for at the cinema.", "Not that greatI really don't know what planet some of these reviewers came from but this is definitely not a fantastic movie. The characters seem stereotyped and lacking depth. I tried, I often go to see movies that don't fit the box office genre but in my opinion, this year's award was looking for one of this genre, rather than it being a top movie deserving an award.", "I don't get itI really don't get why everybody thinks it is so good.\n\nIt is way too long and boring as hell.\n\nThe text messages in between aren't translated so you dont really know what it is about.", "It's a sheer time waste.It's a sheer time waste. Till end you got bored, bored. I can't give 2 ranking too But i spent whole 2.11 hours that's why this is.", "Opens well only to become an epic failAs a fan of foreign films I was excited to watch this after its Oscar success, but unfortunately it collapsed in its second half -- so badly I had to abandon viewing it.\n\nThe opening of the film, introducing the starving Kim family and their machinations to secure work as the household staff of the Park family. It beautifully demonstrates the life in the city slums, with superbly executed plots to get the Parks' existing staff fired and replaced with the Kims. These plots become progressively more cruel, showing the Kims' slide into villainy.\n\nThe complication arrives when the former head maid asks the Kims if she can retrieve something from the Park house. Here the Kims truly become villains, manipulating the secrets of the house for their own gain and even turning to overt violence to preserve their position. It is here that the film loses its way.\n\nThough certainly the Kims and their rivals have difficult choices to make, they are depicted as being gratuitously cruel. Each faction needs to remove obstacles, of course; each faction shows no restraint, fine. But the film lingers on this wickedness for so long, the audience becomes estranged to all of them. We no longer care about ANY of these characters because they have all become monsters; we abandon watching their fight because we have better things to do with our lives.\n\nThe failure of this film (as with so many of the last few decades) is in the writing and editing. The sets are beautiful, the camerawork superb. But the film lingers on human suffering purely for the shock factor. The suffering of the Kims is sadly reality for those at the bottom of South Korean society, and desperation makes villains of us all, but this is not a documentary. This is meant to be entertainment, something people can enjoy. Angela's Ashes depicted similar levels of poverty yet still maintained the sympathy of the audience.", "Wastages for teenagerThis movie is only good for old & mature people .it not for young generation 😜😂 Waste of night for me"]